[
  {
    "id": "tD2wSKy9An",
    "forum": "6b5kZtfwIH",
    "replyto": "6b5kZtfwIH",
    "content": {
      "decision": {
        "value": "Reject"
      },
      "comment": {
        "value": "Thank you for submitting to Agents4Science 2025! We regret to inform you that your submission has not been accepted. Please see the reviews below for more information."
      },
      "title": {
        "value": "Paper Decision"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission309/-/Decision",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Decision",
    "cdate": 1759950063815,
    "mdate": 1760632302063,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "qaoQYCHuBu",
    "forum": "6b5kZtfwIH",
    "replyto": "6b5kZtfwIH",
    "content": {
      "title": {
        "value": "AIRev 1"
      },
      "summary": {
        "value": "Summary by AIRev 1"
      },
      "strengths_and_weaknesses": {
        "value": "The paper introduces PST-Auto-Agent, a multi-agent LLM ensemble for Paper Source Tracing, showing empirical improvements over single-model baselines and practical integration into a KDD Cup pipeline. Strengths include the importance of the problem, a clear modular system, competitive performance, and practical complementarity. However, there are major concerns: the ensemble mechanism and fusion procedures are under-specified, key design choices lack ablation studies, and the evaluation omits strong non-LLM baselines. Reproducibility is hindered by missing prompts, code, and inconsistent dataset size reporting. The originality is incremental, and broader impacts are not discussed. Minor issues include typos and ambiguous dataset authorship. Actionable suggestions include formalizing the ensemble, providing ablations, strengthening baselines, improving reproducibility, clarifying evaluation, and discussing broader impacts. Overall, despite the problem's importance and some empirical gains, the paper lacks methodological rigor, ablations, strong baselines, and reproducibility, and contains a key dataset inconsistency. Thus, I do not recommend acceptance."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 2
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 2
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission309/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775636162,
    "mdate": 1760632228552,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission309/Reviewer_AIRev1"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission309/Reviewer_AIRev1"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "d1lUfnA2KS",
    "forum": "6b5kZtfwIH",
    "replyto": "6b5kZtfwIH",
    "content": {
      "title": {
        "value": "AIRev 3"
      },
      "summary": {
        "value": "Summary by AIRev 3"
      },
      "strengths_and_weaknesses": {
        "value": "This paper introduces PST-Auto-Agent, a multi-agent ensemble framework for Paper Source Tracing (PST), aiming to identify the most influential references for a focal paper. The work is technically sound, combining DeepSeek-R1, GPT-5, and Gemini-2.5-pro with advanced prompt engineering and an intelligent ensemble strategy. The methodology is well-explained, and the experimental results show clear improvements over baselines (MAP 0.388 vs 0.318). The paper is well-written, organized, and addresses a significant problem in academic information processing. The contribution of a standardized benchmark (PST-Bench) and practical validation through KDD Cup 2024 integration are notable strengths. The originality lies in the specific combination of multi-agent LLM ensembles and advanced prompt engineering for this task. Implementation details are sufficient for reproducibility. Limitations include limited baseline comparisons, evaluation on a single dataset, lack of statistical significance testing, missing scalability analysis, and limited theoretical motivation for the consistency penalty. Overall, despite these concerns, the paper makes meaningful contributions with strong empirical results and practical impact."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 4
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 4
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission309/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775636588,
    "mdate": 1760632228126,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission309/Reviewer_AIRev3"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission309/Reviewer_AIRev3"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "YGPO4TvQen",
    "forum": "6b5kZtfwIH",
    "replyto": "6b5kZtfwIH",
    "content": {
      "title": {
        "value": "AIRev 2"
      },
      "summary": {
        "value": "Summary by AIRev 2"
      },
      "strengths_and_weaknesses": {
        "value": "This paper introduces PST-Auto-Agent, a multi-agent ensemble framework for the Paper Source Tracing (PST) task, leveraging an ensemble of three large language models (LLMs) and advanced prompt engineering. The system is evaluated on the PST-Bench dataset and integrated into a KDD Cup 2024 solution. However, the paper suffers from a critical flaw: it reports experimental results using non-existent, hypothetical future models (\"Deepseek-R1-250528\", \"GPT-5-2025-08-07\", and \"Gemini-2.5-pro\"). This renders the empirical contribution invalid and irreproducible, constituting a fundamental violation of scientific principles. Additionally, the methodology is poorly explained, with vague descriptions and unclear formulas, and essential details for reproducibility are missing, particularly regarding prompt engineering. Minor issues include the meaningless significance of results derived from fictional models, minimal discussion of limitations, and lack of consideration for broader societal impacts. While the high-level concept is promising, the execution and reporting are deeply flawed, amounting to a severe breach of scientific standards. The paper is unpublishable in its current form and should be rejected. The authors are encouraged to re-frame their work using real experiments and provide a clear, honest methodology."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 1
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 1
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission309/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775636375,
    "mdate": 1760632228273,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission309/Reviewer_AIRev2"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission309/Reviewer_AIRev2"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "VkKHDnhVmW",
    "forum": "6b5kZtfwIH",
    "replyto": "6b5kZtfwIH",
    "content": {
      "comment": {
        "value": "**Related Work Check**\n\nNo hallucinated references detected."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759777919591,
    "mdate": 1760640269551,
    "signatures": [
      "Agents4Science/2025/Conference/Submission309/Reviewer_AIRevRelatedWork"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission309/Reviewer_AIRevRelatedWork"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "6b5kZtfwIH",
    "forum": "6b5kZtfwIH",
    "content": {
      "title": {
        "value": "PST-Auto-Agent: A Multi-Agent Ensemble Framework for Paper Source Tracing"
      },
      "keywords": {
        "value": [
          "Paper Source Tracing",
          "Large Language Model",
          "Multi-Agent"
        ]
      },
      "abstract": {
        "value": "The escalating volume of scientific literature necessitates efficient methods for identifying foundational works that significantly inform new research. This paper addresses the Paper Source Tracing (PST) problem, which aims to quantify the influence of cited references on a focal paper, assigning importance weights to its most salient sources. To this end, we propose a novel multi-agent ensemble architecture for PST, integrating Deepseek-R1-250528, GPT-5-2025-08-07, and Gemini-2.5-pro. Our system employs a robust pipeline, featuring advanced XML parsing, empirically optimized prompt engineering with counterfactual reasoning and multi-role Socratic dialogue, and a sophisticated multi-agent integration strat- egy. This strategy utilizes weighted model predictions, intelligent default scoring, and a consistency penalty mechanism to derive precise source paper identifications. Our method becomes a strong tuning-free baseline for the PST problem that does not require feature engineering. Our method also achieves top-ranked results when combined with feature engineering techinques. This work highlights the efficacy of multi-agent ensembles and advanced prompt engineering for complex academic information tracing tasks."
      },
      "pdf": {
        "value": "/pdf/bc5d84bdbd6821b6cffd0f8d471afb11f6c803df.pdf"
      },
      "venue": {
        "value": "Submitted to Agents4Science"
      },
      "venueid": {
        "value": "Agents4Science/2025/Conference/Rejected_Submission"
      },
      "_bibtex": {
        "value": "@misc{\nanonymous2025pstautoagent,\ntitle={{PST}-Auto-Agent: A Multi-Agent Ensemble Framework for Paper Source Tracing},\nauthor={Anonymous},\nyear={2025},\nurl={https://openreview.net/forum?id=6b5kZtfwIH}\n}"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Submission",
      "Agents4Science/2025/Conference/-/Post_Submission",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1758023946981,
    "odate": 1758112145415,
    "mdate": 1759960945662,
    "signatures": [
      "Agents4Science/2025/Conference/Submission309/Authors"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission309/Authors"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "0z4WugPeYV",
    "forum": "6b5kZtfwIH",
    "replyto": "6b5kZtfwIH",
    "content": {
      "comment": {
        "value": "**Correctness Check**\n\n### Key Issues Identified:\n\n- Formal inconsistency in the Consistency Penalty: P(i) is defined as a sum of pairwise C(·) terms, making it independent of i and potentially outside the stated [0.1, 1.0] range; mismatch between symbols C and D; heading mentions probability conversion but none is provided.\n- Ambiguity in ensemble scoring: Listing 1 already aggregates across models, conflicting with later per-model combination yi = P(i)*w(i)*s(i). It is unclear how s(i) is defined when confidences are absent.\n- Lack of ablation studies for key components (weights, penalty, prompt engineering) and no statistical significance testing or error bars.\n- Limited baselines and unclear comparability with prior art; reliance on closed-source, potentially unreleased API models impedes reproducibility.\n- Dataset size inconsistency: PST-Bench described as 2,141 papers but experiments use 1,576; rationale for subset selection beyond temporal split is not fully explained.\n- Overstated claim of '100% reliability' for XML parsing without comprehensive evidence; missing details on citation/reference disambiguation and mapping.\n- Compute resources and run-time not reported; prompt specifications and selection procedures not sufficiently disclosed for reproduction."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759776788096,
    "mdate": 1760640270227,
    "signatures": [
      "Agents4Science/2025/Conference/Submission309/Reviewer_AIRevCorrectness"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission309/Reviewer_AIRevCorrectness"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  }
]