[
  {
    "id": "v8i6SAe1ip",
    "forum": "6jqcouwCay",
    "replyto": "6jqcouwCay",
    "content": {
      "title": {
        "value": "AIRev 2"
      },
      "summary": {
        "value": "Summary by AIRev 2"
      },
      "strengths_and_weaknesses": {
        "value": "This paper presents a bold and ambitious demonstration of an autonomous multi-agent system for scientific discovery in thermoelectric materials, executing 361 independent research projects without human intervention. The main contributions are the unprecedented scale, real-world resilience (including recovery from agent malfunction), and a reproducible hierarchical multi-agent architecture with integrated quality assurance and a novel cyclic learning mechanism. The system architecture is technically sound, with a clear chain of command and embedded QA. The detailed case study of agent malfunction demonstrates robustness beyond typical \"hero run\" papers. The primary weakness is the incomplete and distributed logging of performance metrics, with only partial data recovered post-hoc, which is a significant methodological flaw. However, the authors are exceptionally transparent about this issue. The paper is exceptionally well-written, clear, and logically organized, with transparent reporting and nuanced interpretation of results. The significance and originality are extremely high, representing a potential paradigm shift in autonomous scientific research. The authors commit to releasing all code, data, and logs, supporting reproducibility. Limitations and ethical considerations are discussed with commendable transparency. Despite the logging flaw, the paper's ambition, execution, and transparency make a strong case for acceptance, and its insights are of immense value to the community."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 5
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 5
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission76/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759776042342,
    "mdate": 1760632158441,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission76/Reviewer_AIRev2"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission76/Reviewer_AIRev2"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "sp128H8ehi",
    "forum": "6jqcouwCay",
    "replyto": "6jqcouwCay",
    "content": {
      "comment": {
        "value": "**Related Work Check**\n\nPlease look at your references to confirm they are good.\n\n**Examples of references that could not be verified (they might exist but the automated verification failed):**\n\n- Thermoelectric materials: New directions and approaches by GD Mahan and JO Sofo\n- Starrydata: A comprehensive database for thermoelectric materials properties by Y Katsura et al."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759777865199,
    "mdate": 1760640268182,
    "signatures": [
      "Agents4Science/2025/Conference/Submission76/Reviewer_AIRevRelatedWork"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission76/Reviewer_AIRevRelatedWork"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "LF6b8m87QN",
    "forum": "6jqcouwCay",
    "replyto": "6jqcouwCay",
    "content": {
      "comment": {
        "value": "**Correctness Check**\n\n### Key Issues Identified:\n\n- Mischaracterization of a universal theoretical zT ≤ 3.2 limit; 3.2 is not a universal constant and should not be enforced as a theoretical bound.\n- Use of a fixed Lorenz number for Wiedemann–Franz adherence in semiconductors is inappropriate; L varies with material and conditions.\n- Leakage prevention via simple string matching (Algorithm 2) is insufficient and may both miss true leakage and remove valid features; the claim of 100% prevention is unsubstantiated.\n- Overfitting control (train–test R2 gap < 0.1) is asserted but not evidenced; extreme negative R2 values suggest failures not analyzed.\n- Experimental reporting is incomplete: only 216/361 projects have recovered metrics and only 44 report R2; only 2 have full QA checklists; conclusions are thus not robust.\n- No quantitative baselines or ablations; the checklist claims baselines are included while the text defers them due to logging gaps (contradiction).\n- Quality score algorithm lacks explicit normalization of components (D, P, S), so the asserted range [0,100] is not guaranteed.\n- QA checklist includes items misaligned with the regression task (e.g., class balance), indicating a generic rather than task-specific validation protocol.\n- Uncertainty quantification and SHAP analyses are claimed but not demonstrated with concrete results or diagnostics.\n- Claimed 10× acceleration lacks quantitative evidence within the paper; autonomy vs human-in-the-loop statements are inconsistent."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759776935351,
    "mdate": 1760640268878,
    "signatures": [
      "Agents4Science/2025/Conference/Submission76/Reviewer_AIRevCorrectness"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission76/Reviewer_AIRevCorrectness"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "E6D6qqiMt4",
    "forum": "6jqcouwCay",
    "replyto": "6jqcouwCay",
    "content": {
      "title": {
        "value": "AIRev 1"
      },
      "summary": {
        "value": "Summary by AIRev 1"
      },
      "strengths_and_weaknesses": {
        "value": "The paper presents an ambitious hierarchical multi-agent system for autonomous thermoelectric materials analysis, executing 361 projects with integrated QA, physics checks, ML modeling, and resilience mechanisms. Strengths include impressive scale, clear architecture, embedded QA/physics checks, resilience to agent failure, and intent for reproducibility. However, the evaluation is incomplete and inconsistently logged, with only partial recoverable metrics and weak ML results (mean R2 = 0.124 ± 2.63, with large negative outliers). Claims of leakage prevention and physics compliance are insufficiently validated, relying on keyword filters and hard caps without robustness analysis. Scientific contributions are underspecified, lacking concrete discoveries or baseline comparisons. Reproducibility is undermined by post-hoc metric extraction and sparse methodological details. Related work coverage is incomplete. Suggestions include establishing standardized experiment tracking, providing rigorous baselines and ablations, validating leakage prevention, strengthening scientific claims, evaluating fault tolerance, clarifying physical checks, improving documentation, and expanding related work. Overall, while the system and scale are promising, the empirical evidence is too thin and uneven to support strong conclusions. Recommendation: Borderline reject."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 3
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 3
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission76/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759776042151,
    "mdate": 1760632158615,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission76/Reviewer_AIRev1"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission76/Reviewer_AIRev1"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "DDGz4ROlmN",
    "forum": "6jqcouwCay",
    "replyto": "6jqcouwCay",
    "content": {
      "title": {
        "value": "AIRev 3"
      },
      "summary": {
        "value": "Summary by AIRev 3"
      },
      "strengths_and_weaknesses": {
        "value": "This paper presents an autonomous multi-agent research system that conducted 361 thermoelectric materials research projects. The scale and ambition are impressive, and the hierarchical multi-agent approach and cyclic theme system appear novel. The system architecture and failure recovery analysis provide value, and the authors address limitations and ethical considerations appropriately. However, there are significant concerns: only 59.8% of projects have documented performance metrics, R² values are reported for just 12.2% of projects with highly variable and sometimes extreme negative results, and quality scores are available for only 2 complete projects. The paper lacks systematic performance tracking, making it difficult to assess the system's effectiveness or scientific impact. Technical details about key mechanisms are unclear, and there is no meaningful comparison to human or other automated approaches. While the work tackles an important problem with innovation and scale, the incomplete evaluation and missing data significantly weaken the contribution."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 3
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 3
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission76/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759776042569,
    "mdate": 1760632158296,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission76/Reviewer_AIRev3"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission76/Reviewer_AIRev3"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "6jqcouwCay",
    "forum": "6jqcouwCay",
    "content": {
      "title": {
        "value": "Autonomous Multi-Agent Scientific Research: A 361-Project Case Study in Thermoelectric Materials Discovery"
      },
      "keywords": {
        "value": [
          "autonomous multi-agent systems",
          "thermoelectric materials",
          "scientific discovery automation",
          "materials informatics"
        ]
      },
      "TLDR": {
        "value": "A hierarchical multi-agent system autonomously executed 361 thermoelectric materials research projects, demonstrating that AI agent coordination can maintain scientific rigor while achieving unprecedented research throughput."
      },
      "abstract": {
        "value": "We present an autonomous multi-agent research system that conducted large-scale scientific discovery without human intervention. The system executed 361 thermoelectric materials projects across multiple research cycles, demonstrating unprecedented scale in autonomous research. Our hierarchical architecture spans experimental validation, theoretical physics checks, ML modeling, and documentation synthesis. Key achievements include: (1) 100\\% physical constraint compliance ($0 \\le zT \\le 3.2$) across all projects; (2) knowledge accumulation through 7,500 RAG entries; (3) resilience validated through real-world agent malfunction recovery. While complete metrics were not systematically captured, distributed data extraction revealed performance documentation in 59.8\\% of projects. This work establishes autonomous multi-agent coordination as a viable paradigm for accelerating scientific discovery."
      },
      "pdf": {
        "value": "/pdf/ce23ace9f5ed3a6444b55a3fbdd2fa1fd45365df.pdf"
      },
      "venue": {
        "value": "Submitted to Agents4Science"
      },
      "venueid": {
        "value": "Agents4Science/2025/Conference/Rejected_Submission"
      },
      "_bibtex": {
        "value": "@misc{\nanonymous2025autonomous,\ntitle={Autonomous Multi-Agent Scientific Research: A 361-Project Case Study in Thermoelectric Materials Discovery},\nauthor={Anonymous},\nyear={2025},\nurl={https://openreview.net/forum?id=6jqcouwCay}\n}"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Submission",
      "Agents4Science/2025/Conference/-/Post_Submission",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1756875224253,
    "odate": 1758112145415,
    "mdate": 1759960934942,
    "signatures": [
      "Agents4Science/2025/Conference/Submission76/Authors"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission76/Authors"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "41MGCfeCN1",
    "forum": "6jqcouwCay",
    "replyto": "6jqcouwCay",
    "content": {
      "decision": {
        "value": "Reject"
      },
      "comment": {
        "value": "Thank you for submitting to Agents4Science 2025! We regret to inform you that your submission has not been accepted. Please see the reviews below for more information."
      },
      "title": {
        "value": "Paper Decision"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission76/-/Decision",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Decision",
    "cdate": 1759950660729,
    "mdate": 1760632268097,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  }
]