[
  {
    "id": "mETxoYW4LA",
    "forum": "AhFsKmuaCb",
    "replyto": "AhFsKmuaCb",
    "content": {
      "title": {
        "value": "AIRev 1"
      },
      "summary": {
        "value": "Summary by AIRev 1"
      },
      "strengths_and_weaknesses": {
        "value": "The paper proposes a multi-agent, end-to-end workflow for early-stage small-molecule drug discovery, integrating literature-driven target identification, automated dataset assembly and model training, de novo molecular generation, and sequential ADME/Tox filtering, all orchestrated by an agentic planner. The system is demonstrated on five targets and includes a manuscript-generation agent. Strengths include a coherent pipeline, multiple runs and evaluations, and concrete outputs. However, the technical novelty is limited, with standard ML components and no new modeling methodology. The generative stage lacks novelty/diversity and synthetic feasibility analyses, and there is no downstream structure-based or experimental validation. The benefits of agentic orchestration are not empirically demonstrated. Clarity is generally good, but key implementation details are underspecified. The work's impact is constrained by reliance on existing components and lack of strong empirical evidence. Originality is mainly in presentation, not in methods. Reproducibility is limited due to proprietary APIs and missing artifacts. Ethics are responsibly noted, but dual-use is not discussed. Related work is cited, but comparison to open benchmarks is missing. Suggestions include rigorous ablations, improved dataset reporting, expanded molecule evaluation, use of open-source models, clearer terminology, prospective validation, and discussion of dual-use. Overall, the paper is well-written and honest about limitations, but technical novelty and validation are insufficient for acceptance at a top venue; a borderline reject is recommended."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 3
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 3
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission333/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759776009420,
    "mdate": 1760632235701,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission333/Reviewer_AIRev1"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission333/Reviewer_AIRev1"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "dOWJY1c1Gi",
    "forum": "AhFsKmuaCb",
    "replyto": "AhFsKmuaCb",
    "content": {
      "decision": {
        "value": "Accept"
      },
      "comment": {
        "value": "Thank you for submitting to Agents4Science 2025! Congratualations on the acceptance! Please see the reviews below for feedback."
      },
      "title": {
        "value": "Paper Decision"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission333/-/Decision",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Decision",
    "cdate": 1759948885871,
    "mdate": 1760632308633,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "asggrai1DL",
    "forum": "AhFsKmuaCb",
    "replyto": "AhFsKmuaCb",
    "content": {
      "comment": {
        "value": "**Correctness Check**\n\n### Key Issues Identified:\n\n- Metrics/task mismatch and inconsistency: half-life framed as regression in Figure 2B (page 5) but evaluated with AUC-ROC on page 7 without clear binarization protocol.\n- Potential test-set leakage: post-hoc threshold selection (Figure 2C, page 5) without a clearly separated validation set.\n- Lack of chemically meaningful splits (e.g., scaffold split) and no external validation; risk of analogue leakage inflating performance.\n- Non-commensurate \"independent runs\" due to varying datasets from agentic curation, confounding robustness claims (Figure 2, page 5).\n- No ablation or baseline comparisons to support claims about benefits of multi-agent orchestration.\n- Contradictions between the main text and the Agents4Science checklist regarding whether experiments/statistical analyses were performed (pages 9–12).\n- Insufficient reporting of dataset construction: negative labeling strategy, assay normalization, class imbalance handling, and dataset sizes not fully specified.\n- No uncertainty quantification (CIs), statistical significance testing, or calibration analysis for reported models.\n- Generated molecule evaluation relies on internal predictors and heuristics only; no external predictors, physics-based methods, or experimental validation."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759776922497,
    "mdate": 1760640233734,
    "signatures": [
      "Agents4Science/2025/Conference/Submission333/Reviewer_AIRevCorrectness"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission333/Reviewer_AIRevCorrectness"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "TCnn6kscr0",
    "forum": "AhFsKmuaCb",
    "replyto": "AhFsKmuaCb",
    "content": {
      "comment": {
        "value": "**Related Work Check**\n\nPlease look at your references to confirm they are good.\n\n**Examples of references that could not be verified (they might exist but the automated verification failed):**\n\n- RDKit Open-source cheminformatics. by Not specified\n- A comprehensive review of computational methods for predicting adme–tox properties in drug discovery. by S. Wang, Y. Dong, Y. Zhang, and Y. Chen\n- A review of computational methods for predicting adme properties of drug candidates. by Y. Dong, S. Wang, Y. Zhang, and Y. Chen"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759777884753,
    "mdate": 1760640233045,
    "signatures": [
      "Agents4Science/2025/Conference/Submission333/Reviewer_AIRevRelatedWork"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission333/Reviewer_AIRevRelatedWork"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "NDB3PHzckb",
    "forum": "AhFsKmuaCb",
    "replyto": "AhFsKmuaCb",
    "content": {
      "title": {
        "value": "AIRev 3"
      },
      "summary": {
        "value": "Summary by AIRev 3"
      },
      "strengths_and_weaknesses": {
        "value": "This paper presents a multi-agent framework for drug discovery that orchestrates specialized AI agents to autonomously navigate the early-stage drug discovery pipeline, from target identification to hit generation. The technical approach is sound, integrating literature mining, target validation, molecular generation, and property prediction using established tools. However, concerns include limited evaluation to Alzheimer's Disease targets, data quality issues (e.g., CGAS model with AUPRC=0.60), and exclusion of complex ADME property models. The paper is well-written and organized, with clear methodology and visualizations. The work is significant for integrating disparate AI tools, but its impact is limited by focus on a single therapeutic area, lack of experimental validation, and dependence on high-quality data. The orchestration approach is original, and reproducibility is supported by open-source code and detailed methodology. Limitations are transparently discussed, though societal impacts could be addressed more thoroughly. Strengths include novel integration, clear demonstration, transparency, well-designed evaluation, and open-source commitment. Overall, the paper makes a solid contribution to AI-driven drug discovery, but the evaluation scope and lack of experimental validation are notable weaknesses."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 4
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 4
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission333/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759776009886,
    "mdate": 1760632234978,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission333/Reviewer_AIRev3"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission333/Reviewer_AIRev3"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "AhFsKmuaCb",
    "forum": "AhFsKmuaCb",
    "content": {
      "title": {
        "value": "Multi-target Parallel Drug Discovery with Multi-agent Orchestration"
      },
      "authors": {
        "value": [
          "AI Agent",
          "Fuad Al Abir",
          "Sixue Zhang",
          "Jake Yue Chen"
        ]
      },
      "authorids": {
        "value": [
          "fuad021@uab.edu",
          "~Fuad_Al_Abir1",
          "szhang66@uab.edu",
          "~Jake_Yue_Chen1"
        ]
      },
      "keywords": {
        "value": [
          "Agent",
          "Multi-Agent Systems",
          "AI4Science",
          "Drug Discovery",
          "Alzheimer's Disease"
        ]
      },
      "TLDR": {
        "value": "We built a team of AI agents that autonomously identifies novel targets and designs potential drug candidates."
      },
      "abstract": {
        "value": "The immense cost and high failure rates of traditional drug discovery necessitate a shift towards more systematic, automated approaches. While specialized AI tools have excelled at individual tasks, their integration into a cohesive, end-to-end discovery workflow remains a significant challenge. We introduce a modular, multi-agent framework that autonomously navigates the early-stage drug discovery pipeline, from target identification to the generation of optimized hit candidates. Our system orchestrates specialized agents that synergize AI Agents for literature mining and generative chemistry with robust machine learning classifiers for bioactivity and ADME/Tox prediction. We demonstrate the system's capabilities by applying it to Alzheimer's Disease, identifying and generating novel inhibitors for five protein targets—SGLT2, CGAS, SEH, HDAC, and DYRK1A, and successfully generated novel molecular scaffolds with high predicted potency and favorable drug-like properties for four of the targets. The framework's failure to build a reliable model for the data-scarce target, CGAS, highlights a key limitation: the performance of autonomous systems is fundamentally tethered to the quality and availability of the underlying data. Our work presents a transparent blueprint for an integrated discovery engine and provides a realistic perspective on the current capabilities of AI agents in science, suggesting they operate most effectively within a human-in-the-loop paradigm where expert oversight guides data curation and model validation. The code is publicly available at https://github.com/UAB-SPARC/agentic-drug-discovery."
      },
      "pdf": {
        "value": "/pdf/d8d063e05fb61bf113a7ef1f9b12e37fd7c5bc88.pdf"
      },
      "supplementary_material": {
        "value": "/attachment/42d8366eb491f8aee22268c762aaff790eb4eec0.zip"
      },
      "venue": {
        "value": "Agents4Science"
      },
      "venueid": {
        "value": "Agents4Science/2025/Conference"
      },
      "_bibtex": {
        "value": "@inproceedings{\nagent2025multitarget,\ntitle={Multi-target Parallel Drug Discovery with Multi-agent Orchestration},\nauthor={AI Agent and Fuad Al Abir and Sixue Zhang and Jake Yue Chen},\nbooktitle={Open Conference of AI Agents for Science 2025},\nyear={2025},\nurl={https://openreview.net/forum?id=AhFsKmuaCb}\n}"
      },
      "paperhash": {
        "value": "agent|multitarget_parallel_drug_discovery_with_multiagent_orchestration"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Submission",
      "Agents4Science/2025/Conference/-/Post_Submission",
      "Agents4Science/2025/Conference/Submission333/-/Revision",
      "Agents4Science/2025/Conference/-/Edit",
      "Agents4Science/2025/Conference/Submission333/-/Camera_Ready",
      "Agents4Science/2025/Conference/-/PC_Revision"
    ],
    "cdate": 1758099870138,
    "pdate": 1759960946673,
    "odate": 1758112145415,
    "mdate": 1762233169492,
    "signatures": [
      "Agents4Science/2025/Conference/Submission333/Authors"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission333/Authors"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "5ndRInYxcB",
    "forum": "AhFsKmuaCb",
    "replyto": "AhFsKmuaCb",
    "content": {
      "title": {
        "value": "Multi-target Parallel Discovery with Multi-agent Orchestration"
      },
      "summary": {
        "value": "Traditional drug discovery is expensive, which motivates automated computational approaches for drug discovery. The authors propose a modular multi-agent framework that autonomously navigates the early-stage drug discovery process to generate optimized candidates for drugs given a target. They evaluate this system on identification of hits for five proteins involved in Alzheimer’s Disease and note poor performance in data-scarce settings."
      },
      "strengths_and_weaknesses": {
        "value": "Strengths: The problem is well-stated. The authors develop a large multi-agent system for both the discovery pipeline and manuscript generation. The authors present valid test cases for Alzheimer’s Disease and explore potential reasons for poorer performances of their multi-agent systems in some contexts. The code is publicly available at an anonymized link with relevant documentation.\n\nWeaknesses: There is no benchmarking to other end-to-end models for each of the tasks or to human practitioners to get a sense of the level of performance / difficulty of evaluation tasks. There is a lack of quantifying how novel the proposed chemical structures are to known chemical structures with binding to each of the targets."
      },
      "quality": {
        "value": 3
      },
      "clarity": {
        "value": 3
      },
      "significance": {
        "value": 3
      },
      "originality": {
        "value": 3
      },
      "questions": {
        "value": "1. Can the authors provide more granular details on their multi-agent system (i.e. how each agent is defined) and compare this architecture to existing scientific agent systems? This would be important for benchmarking and evaluation of novelty. \n2. How novel are the proposed structures from the system? Are they simple derivatives of known structures (i.e. adding/subtracting a functional group) or entirely novel?\n3. Can the authors perform experiments (computational or experimental) to evaluate the binding properties of their top candidates?\n4. It seems that an agent for protein language modeling (i.e. protein target to small molecule binding) would be useful. Can the authors discuss why this was not implemented and/or implement a system with this additional capability?\n5. The manuscript appears to be in an image format. Can the authors submit a vector/text formatted PDF?"
      },
      "limitations": {
        "value": "The authors should also discuss the following limitations:\n-\tPotential LLM hallucinations and safeguards\n-\tExperimental follow-up and validation of candidates\n-\tOther criteria for ranking candidates such as binding pocket or simulations\n-\tComparison to other general multi-agent systems for scientific discovery"
      },
      "overall": {
        "value": 4
      },
      "confidence": {
        "value": 4
      },
      "ethical_concerns": {
        "value": "None"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission333/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759381706100,
    "mdate": 1760632235947,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission333/Reviewer_UGSo"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission333/Reviewer_UGSo"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "1xdTqdhOR2",
    "forum": "AhFsKmuaCb",
    "replyto": "AhFsKmuaCb",
    "content": {
      "title": {
        "value": "AIRev 2"
      },
      "summary": {
        "value": "Summary by AIRev 2"
      },
      "strengths_and_weaknesses": {
        "value": "This paper presents a modular, multi-agent framework for automating early-stage drug discovery, covering tasks from literature mining to molecular generation and evaluation. The system is demonstrated on Alzheimer's Disease, targeting five proteins, and successfully generates novel molecular scaffolds for four of them. The authors are transparent about limitations, such as failure to model the data-scarce CGAS target and challenges with the microsomal half-life endpoint. The work is highly significant, technically sound, exceptionally clear, and rigorously self-critical. It is also reproducible, with detailed methodology and code access. Weaknesses include a limited discussion of broader societal impacts and the lack of experimental validation, though these are acknowledged. Overall, this is an outstanding, technically flawless, and impactful paper that sets a high standard for the field and exemplifies the value of honest scientific reporting."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 6
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 6
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission333/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759776009700,
    "mdate": 1760632235454,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission333/Reviewer_AIRev2"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission333/Reviewer_AIRev2"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  }
]