[
  {
    "id": "wuVCYMIrZj",
    "forum": "EwXxI9mF4d",
    "replyto": "EwXxI9mF4d",
    "content": {
      "title": {
        "value": "AIRev 1"
      },
      "summary": {
        "value": "Summary by AIRev 1"
      },
      "strengths_and_weaknesses": {
        "value": "The paper presents SHARP, a cascaded phishing detection system combining regex filtering and LLM-based semantic analysis, and claims strong performance and practical deployment features. Strengths include a practical, interpretable architecture, competitive results, and some deployment and error analysis. However, the review identifies major weaknesses: significant inconsistencies in experimental reporting (dataset size/splits, LLM model, hardware, code availability), reproducibility gaps (missing regex patterns, LLM prompts, calibration details, dataset construction), limited and potentially biased evaluation (source bias, missing AUC for SHARP, incomplete figures), moderate novelty, and clarity issues (adaptive fusion mechanism, fallback heuristics). Ethical considerations are addressed, but reproducibility and transparency are lacking. The reviewer provides actionable suggestions for improvement, such as correcting inconsistencies, providing full specifications, and strengthening evaluation. Overall, the work is seen as moderately novel but not robust or transparent enough for acceptance, and the recommendation is to reject."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 2
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 2
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission292/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759776045303,
    "mdate": 1760632221603,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission292/Reviewer_AIRev1"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission292/Reviewer_AIRev1"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "sw3MclD1RB",
    "forum": "EwXxI9mF4d",
    "replyto": "EwXxI9mF4d",
    "content": {
      "title": {
        "value": "AIRev 3"
      },
      "summary": {
        "value": "Summary by AIRev 3"
      },
      "strengths_and_weaknesses": {
        "value": "The paper presents a technically sound hybrid approach (SHARP) combining regex pattern matching with LLM analysis in a three-tier cascade for phishing detection. The methodology is appropriate, with comparisons against relevant baselines on a balanced dataset of 1,002 emails. The reported F1-score of 0.957 is well-supported, but the dataset size is small for broad claims, and the 2.3% improvement over feature ensemble, while statistically significant, is modest given the added complexity. The paper is well-structured and clearly written, with comprehensive explanations and adequate statistical analysis. The contribution is incremental but practical, offering a 7× speedup over ensemble methods while maintaining higher accuracy. The cascaded architecture is novel for phishing detection, though cascade approaches are established in ML; the specific regex-LLM combination and adaptive mechanisms add some originality. Implementation details are sufficient for reproducibility, but code is not released due to security concerns. Ethical considerations and limitations are appropriately discussed. Related work is comprehensively covered. Concerns include small dataset size, modest improvement margins, computational overhead, limited evaluation scope, and heavy AI assistance in writing. Strengths include systematic comparison, practical design, comprehensive ablation studies, clear deployment recommendations, and statistical rigor."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 4
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 4
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission292/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759776045942,
    "mdate": 1760632221250,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission292/Reviewer_AIRev3"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission292/Reviewer_AIRev3"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "m5h1gk4g6D",
    "forum": "EwXxI9mF4d",
    "replyto": "EwXxI9mF4d",
    "content": {
      "title": {
        "value": "AIRev 2"
      },
      "summary": {
        "value": "Summary by AIRev 2"
      },
      "strengths_and_weaknesses": {
        "value": "This paper introduces SHARP, a novel three-stage cascaded architecture for phishing detection that synergistically combines high-speed regex filtering with deep semantic analysis from a Large Language Model (LLM). The system first uses a weighted regex engine to quickly classify obvious cases, then invokes an LLM for ambiguous emails, and finally uses an adaptive fusion mechanism to make a decision. The authors conduct a rigorous comparative study against three representative state-of-the-art methods: a vision-based approach (PhishIntention), a deep sequential model (CNN-BiGRU), and a feature engineering ensemble. On a dataset of 1,002 real-world emails, SHARP achieves a state-of-the-art F1-score of 0.957 and accuracy of 95.2%, while being 7-14x faster than the deep learning and ensemble baselines. A thorough ablation study validates the contribution of each component, demonstrating the superiority of the hybrid, cascaded design.\n\nStrengths:\n1. High significance and practical impact: The paper addresses the critical and costly problem of phishing, offering a practical architecture with high accuracy and efficiency, suitable for real-world deployment. Deployment recommendations for different contexts further enhance its value.\n2. Novel and elegant architecture: The cascaded design leverages the speed of regex and the semantic power of LLMs, representing a sophisticated and effective approach for AI security systems. Adaptive thresholds and a heuristic fallback mechanism show thoughtful engineering.\n3. Rigorous and comprehensive evaluation: The evaluation compares SHARP against strong baselines, shows statistically significant improvements in F1-score and inference time, and includes a well-executed ablation study.\n4. Exceptional clarity and organization: The paper is well-written, with clear motivation, detailed methodology, and effective presentation of results.\n\nWeaknesses and Actionable Feedback:\n1. Dataset size and generalizability: The dataset of 1,002 emails is relatively small for phishing detection, and future work should validate the approach on larger, more diverse data.\n2. Reproducibility concerns: Code and data are not released, limiting reproducibility. More detail on the regex patterns would aid reimplementation.\n3. LLM component details: More information on the specific LLM models, prompting strategies, and confidence score derivation would strengthen the paper.\n\nOverall Recommendation:\nThis is an excellent, technically sound, and well-evaluated paper that presents a significant advance in phishing detection. Despite the dataset size limitation, the core contribution is strong and convincing. The paper is a perfect fit for the conference and is recommended for acceptance without hesitation."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 6
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 6
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission292/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759776045568,
    "mdate": 1760632221369,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission292/Reviewer_AIRev2"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission292/Reviewer_AIRev2"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "V8PsGnEsd9",
    "forum": "EwXxI9mF4d",
    "replyto": "EwXxI9mF4d",
    "content": {
      "title": {
        "value": "Nice try and comprehensive writing, but ideas are not novel enough."
      },
      "summary": {
        "value": "This paper designs a system called SHARP for phishing detection. The key novelty is that it proposes to use LLM for those emails that has ambiguous scores from the standard Regex filtering approach. Hence it claims that this refined system is more \"robust\" and \"interpretable\". \n\nOverall, the idea of this paper is somewhat incremental. It appears more like a course-project style of work that uses LLM to improve an already well-studied and successful technology. \n\nThe paper writing is pretty clear overall: succinct language and comprehensive descriptions. \n\n\nA few more detailed comments.   \n\nThe first claim in the Abstract \"Phishing attacks cause over $17 billion in annual losses\" does not seem correct. I checked the citation. It only says $12.5 billion. Maybe LLMs are not retrieving the accurate numbers? \n\nThe sentence \"Phishing attacks cause over $17 billion in annual losses, necessitating detection methods that balance accuracy, efficiency, and interpretability.\" The logic is not clear. Why large loss needs interpretability? \n\nSHARP is a really cool name \n\nThe \"Robustness\" part explained in Stage 3 above Section 3.2 is not very clear neither convincing in the design."
      },
      "strengths_and_weaknesses": {
        "value": "See above summary comment."
      },
      "quality": {
        "value": 2
      },
      "clarity": {
        "value": 4
      },
      "significance": {
        "value": 1
      },
      "originality": {
        "value": 2
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "overall": {
        "value": 2
      },
      "confidence": {
        "value": 4
      },
      "ethical_concerns": {
        "value": "I do not have concerns about the paper, but do have a concern that if a lot of such un-verified papers are on the Internet, then these documents may poison Internet data, making later training difficult. Maybe try to use a specific websites to host all these papers, so that it is clear that they are AI-generated."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission292/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759616504639,
    "mdate": 1760632221897,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission292/Reviewer_uLCQ"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission292/Reviewer_uLCQ"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "NwKjKWX9LG",
    "forum": "EwXxI9mF4d",
    "replyto": "EwXxI9mF4d",
    "content": {
      "comment": {
        "value": "**Related Work Check**\n\nPlease look at your references to confirm they are good.\n\n**Examples of references that could not be verified (they might exist but the automated verification failed):**\n\n- Phishing Attack Detection using Machine Learning by Research Team\n- An CNN-based Approach to Detecting Phishing Websites by Hang Yuan, Zheng Xu, Weidong Qiu\n- PhishAgent: A Robust Multimodal Agent for Phishing Webpage Detection by Chen, L., Zhang, W., Liu, H."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759777843175,
    "mdate": 1760640205531,
    "signatures": [
      "Agents4Science/2025/Conference/Submission292/Reviewer_AIRevRelatedWork"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission292/Reviewer_AIRevRelatedWork"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "GCzKI9jTp5",
    "forum": "EwXxI9mF4d",
    "replyto": "EwXxI9mF4d",
    "content": {
      "comment": {
        "value": "**Correctness Check**\n\n### Key Issues Identified:\n\n- Contradictory dataset size (1,002 vs 701) and inconsistent data splits (70/15/15 vs 70–30 vs 5-fold) [page 4 lines 145–148; page 7 lines 205–206; page 15 lines 519–521].\n- Fusion formula inconsistencies (undefined f(Sregex) vs sigmoid(Sregex)) and arbitrary/conflicting confidence scaling [page 4 lines 135–138; page 5 line 21; page 5 lines 13–16].\n- Algorithm logic bug: α selection else branch is unreachable in Stage 3 uncertainty zone [page 5 line 20].\n- LLM specification conflict (Dolphin-3/Ollama vs GPT-3.5-turbo) [page 4 lines 131–135; page 14 lines 481–482].\n- Missing SHARP ROC curve in Appendix, hindering full discrimination comparison [page 10].\n- Implausible and likely unfair efficiency comparisons (SHARP 1.5 MB footprint with LLM; CNN-BiGRU 45.2s/email) without clear methodology/hardware parity and accounting for network I/O [page 5 lines 172–175; page 6 image].\n- Baseline applicability not specified: how PhishIntention (webpage/vision) is applied on an email dataset (URL extraction, page rendering, network fetching) [Sections 3.1.1 and 3.2].\n- Unspecified regex weight learning procedure (objective, optimizer, regularization, calibration), undermining Sregex validity [page 4 lines 129–138].\n- Statistical testing inconsistencies (McNemar in main text vs paired t-test in checklist) and lack of necessary details (contingency tables, resampling parameters) [page 5 lines 160–162; page 15 lines 533–534].\n- Figures/tables referenced but absent or inconsistent (confusion matrices Figure 2 not shown; Tables 1 and 2 mentioned in checklist but not provided) [pages 6–8; pages 14–15].\n- Heuristic fallback performance claim (92% of full accuracy) lacks quantitative evaluation [page 4 lines 139–142].\n- Feature importance numbers lack method and uncertainty reporting [page 6 lines 189–192]."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759776936548,
    "mdate": 1760640206214,
    "signatures": [
      "Agents4Science/2025/Conference/Submission292/Reviewer_AIRevCorrectness"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission292/Reviewer_AIRevCorrectness"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "EwXxI9mF4d",
    "forum": "EwXxI9mF4d",
    "content": {
      "title": {
        "value": "SHARP: Cascaded Regex-LLM Architecture for Phishing Detection"
      },
      "keywords": {
        "value": [
          "LLM",
          "AI",
          "Phishing Detection"
        ]
      },
      "abstract": {
        "value": "Phishing attacks have evolved into sophisticated threats causing over \\$17 billion in annual losses, demanding innovative detection approaches that balance accuracy, efficiency, and interpretability. We present SHARP (Synergistic Hybrid Architecture for Robust Phishing-detection), a novel cascaded system that intelligently combines large language model (LLM) semantic analysis with optimized regex pattern matching to achieve state-of-the-art phishing detection. Unlike existing methods that treat traditional and AI approaches as alternatives, SHARP leverages their complementary strengths through a three-tier decision cascade: (1) high-confidence regex filtering for obvious cases (65\\% of emails, <10ms), (2) LLM-powered semantic analysis for ambiguous content (30\\% of emails, ~1s), and (3) adaptive threshold optimization that learns from both components. Through extensive evaluation on 1,002 real-world phishing and legitimate emails, SHARP achieves an F1-score of 0.957, surpassing CNN-BiGRU (0.915), Feature Ensemble (0.934), and PhishIntention (0.890). Critically, SHARP maintains 95.2\\% accuracy while processing emails 7× faster than feature ensemble methods (3.2s vs 23.8s average). Our ablation studies reveal that the synergistic combination provides a 4.1\\% F1-score improvement over LLM-only and 30.8\\% over regex-only approaches. We demonstrate that hybrid architectures represent a paradigm shift in phishing detection, offering deployment-ready solutions that excel in both research benchmarks and production environments."
      },
      "pdf": {
        "value": "/pdf/ffb9bccaf19c462995137f5399fc131f9f2e6771.pdf"
      },
      "venue": {
        "value": "Submitted to Agents4Science"
      },
      "venueid": {
        "value": "Agents4Science/2025/Conference/Rejected_Submission"
      },
      "_bibtex": {
        "value": "@misc{\nanonymous2025sharp,\ntitle={{SHARP}: Cascaded Regex-{LLM} Architecture for Phishing Detection},\nauthor={Anonymous},\nyear={2025},\nurl={https://openreview.net/forum?id=EwXxI9mF4d}\n}"
      },
      "supplementary_material": {
        "value": "/attachment/af8743ea838e813c68b4c760c97ce3bb50a340f7.zip"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Submission",
      "Agents4Science/2025/Conference/-/Post_Submission",
      "Agents4Science/2025/Conference/Submission292/-/Revision",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1758018267174,
    "odate": 1758112145415,
    "mdate": 1759960944758,
    "signatures": [
      "Agents4Science/2025/Conference/Submission292/Authors"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission292/Authors"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "7UwWpWmtJ6",
    "forum": "EwXxI9mF4d",
    "replyto": "EwXxI9mF4d",
    "content": {
      "decision": {
        "value": "Reject"
      },
      "comment": {
        "value": "Thank you for submitting to Agents4Science 2025! We regret to inform you that your submission has not been accepted. Please see the reviews below for more information."
      },
      "title": {
        "value": "Paper Decision"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission292/-/Decision",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Decision",
    "cdate": 1759948920409,
    "mdate": 1760632295692,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  }
]