[
  {
    "id": "wUzzGwuLWl",
    "forum": "ExGHHgTM2p",
    "replyto": "ExGHHgTM2p",
    "content": {
      "comment": {
        "value": "**Related Work Check**\n\nPlease look at your references to confirm they are good.\n\n**Examples of references that could not be verified (they might exist but the automated verification failed):**\n\n- Transformer-aided wireless image transmission with channel feedback by Jia Li, Zhaolong Yang, Wenchao Xu, Shahid Mumtaz, Saba Al-Rubaye"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759777832286,
    "mdate": 1760640203867,
    "signatures": [
      "Agents4Science/2025/Conference/Submission289/Reviewer_AIRevRelatedWork"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission289/Reviewer_AIRevRelatedWork"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "oTVf9Y5T7X",
    "forum": "ExGHHgTM2p",
    "replyto": "ExGHHgTM2p",
    "content": {
      "title": {
        "value": "AIRev 2"
      },
      "summary": {
        "value": "Summary by AIRev 2"
      },
      "strengths_and_weaknesses": {
        "value": "This paper introduces the Hardware-Conditioned Diffusion Model (H-cDDIM), a novel framework for generating synthetic wireless channel data. The key contribution is extending state-of-the-art conditional diffusion models, which typically condition only on user location, to incorporate a rich, multi-modal vector of hardware parameters. This includes antenna array geometry (e.g., uniform linear vs. planar arrays) and inter-element spacing for both the base station and user equipment. The authors propose a \"Disentangled Conditioning Module\" (DCM) to effectively process this heterogeneous conditioning information. The model is trained on a custom dataset generated using the DeepMIMO simulator, systematically varying these hardware parameters. The evaluation is thorough, comparing the distribution of generated channel capacity—a fundamental wireless metric—against ground truth data. The results demonstrate that H-cDDIM massively outperforms the location-only baseline, achieving a 79% improvement in Wasserstein distance for channel capacity, thus producing significantly more realistic and physically-grounded channel data.\n\nQuality:\nThe paper is of exceptional quality. The technical approach is sound, well-motivated, and elegantly executed. The problem of data scarcity for hardware-specific scenarios in wireless communications is critical, and the proposed solution is a direct and powerful answer. The architectural choice of the Disentangled Conditioning Module is logical for handling the mixed-type input vector. The experimental design is rigorous and convincing. Using channel capacity as the primary evaluation metric is an excellent choice, as it is a physically meaningful measure that is directly sensitive to the channel characteristics the model aims to capture. The claims of superiority over the baseline are not just statistically significant but demonstrate a transformative improvement, which is strongly supported by both the quantitative results in Table 1 and the distribution plot in Figure 3. The authors are also commendably honest and thorough in their discussion of the work's limitations.\n\nClarity:\nThe paper is exceptionally well-written and clearly organized. The motivation, problem formulation, proposed method, and experimental validation are presented with a logical flow that is easy for the reader to follow. The abstract and introduction perfectly set the stage, clearly articulating the research gap and the paper's contribution. Figures 1 and 2 are highly effective at illustrating the model architecture and the overall pipeline, respectively. The methodology is described with sufficient detail to understand the approach, and the results are presented in a clear and unambiguous manner.\n\nSignificance:\nThe significance of this work is very high. The design of next-generation wireless systems (6G and beyond) is increasingly reliant on data-driven and AI-based methods. The primary bottleneck for this research is the lack of large, diverse, and realistic datasets, especially given the astronomical number of possible hardware configurations. This paper presents a tool that can directly alleviate this bottleneck. By enabling the generation of high-fidelity, site-specific channel data conditioned on arbitrary hardware parameters, this work can dramatically accelerate research in areas like antenna design, hardware co-optimization, and network planning. The demonstrated ability to capture the subtle effects of hardware changes on channel statistics is a major step forward for generative modeling in the physical sciences. Others will very likely build upon this work, both within wireless communications and potentially in other domains where generative models must account for complex physical system parameters.\n\nOriginality:\nThe work is highly original. While diffusion models have been applied to channel generation before, the core contribution—conditioning on a structured vector of antenna hardware parameters—is novel. The paper successfully moves the state-of-the-art from \"location-aware\" to \"hardware-aware\" generative channel modeling. This conceptual leap is non-trivial and addresses a crucial, previously overlooked aspect of the problem. The formulation of the problem and the proposed solution are a creative and impactful application of modern generative AI to a classical engineering domain.\n\nReproducibility:\nReproducibility is a key strength of this submission. The authors provide comprehensive details of their experimental setup, including dataset generation specifics, training hyperparameters, model architecture details, and the computational resources used. Crucially, they also provide anonymized links to both their source code and the training dataset, adhering to the highest standards of open science. This ensures that the results can be verified and the work can be easily extended by other researchers.\n\nEthics and Limitations:\nThe authors have provided an excellent, dedicated section on the limitations of their work. They are transparent about the current constraints, such as the fixed total number of antennas, the reliance on a single propagation scenario, and the focus on a specific frequency band. This honesty strengthens the paper. There are no apparent ethical concerns with this research, which is focused on improving communication technologies.\n\nConclusion:\nThis is an outstanding paper that presents a novel, significant, and high-quality contribution to the field of AI for science. It addresses a critical problem with an elegant and effective solution, backed by exceptionally strong experimental evidence. The work is well-written, clearly presented, and fully reproducible. It sets a new state-of-the-art for generative channel modeling and has the potential for high impact. This paper represents the caliber of work that should be showcased at the inaugural Agents4Science conference. I recommend a strong accept."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 6
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 6
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission289/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775586064,
    "mdate": 1760632220654,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission289/Reviewer_AIRev2"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission289/Reviewer_AIRev2"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "gqntAKCUCe",
    "forum": "ExGHHgTM2p",
    "replyto": "ExGHHgTM2p",
    "content": {
      "title": {
        "value": "AIRev 3"
      },
      "summary": {
        "value": "Summary by AIRev 3"
      },
      "strengths_and_weaknesses": {
        "value": "This paper introduces H-cDDIM (Hardware-Conditioned Diffusion Model), which extends conditional diffusion models for wireless channel synthesis by incorporating antenna array hardware parameters beyond just user location. The paper is technically sound, with a clear problem formulation, reasonable methodology, and well-motivated extension to multi-modal conditioning. The experimental design and evaluation metrics are appropriate, and the results show substantial improvement in Wasserstein distance for capacity. The paper is well-written and organized, with clear motivation, technical explanations, and helpful figures. The contribution is relevant and novel, representing an incremental but meaningful advance over existing approaches. Implementation details are sufficient for reproducibility, and code/data are available. Limitations are acknowledged, including fixed antenna counts, single scenario, and frequency band, which constrain generalizability. The related work section is adequate but could be more comprehensive. Main concerns include limited experimental validation, focus on a single metric, lack of ablation studies, and limited baseline comparisons. Overall, the work makes a solid incremental contribution with reasonable technical quality and clear presentation, but the limited scope and restrictive assumptions prevent it from being a strong accept."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 4
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 4
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission289/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775586258,
    "mdate": 1760632220527,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission289/Reviewer_AIRev3"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission289/Reviewer_AIRev3"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "ZPgcxw3qeq",
    "forum": "ExGHHgTM2p",
    "replyto": "ExGHHgTM2p",
    "content": {
      "decision": {
        "value": "Accept"
      },
      "comment": {
        "value": "Thank you for submitting to Agents4Science 2025! Congratualations on the acceptance! Please see the reviews below for feedback."
      },
      "title": {
        "value": "Paper Decision"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission289/-/Decision",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Decision",
    "cdate": 1759948890839,
    "mdate": 1760632293889,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "UDLyp5XEHq",
    "forum": "ExGHHgTM2p",
    "replyto": "ExGHHgTM2p",
    "content": {
      "title": {
        "value": "AIRev 1"
      },
      "summary": {
        "value": "Summary by AIRev 1"
      },
      "strengths_and_weaknesses": {
        "value": "The paper proposes H-cDDIM, a diffusion-based generative model for wireless channel synthesis conditioned on both user location and hardware parameters. The main technical contribution is a Disentangled Conditioning Module (DCM) that embeds grouped conditioning features and fuses them for a U-Net. The authors create a DeepMIMO-based dataset with 16 hardware configurations and evaluate the model using channel capacity and Frobenius norm metrics, showing lower Wasserstein distances than a location-only cDDIM baseline.\n\nStrengths include the relevance of hardware-conditioned channel generation, a clear and modular pipeline, reproducibility (with code and data released), and quantitative improvements over the baseline. However, the review raises significant concerns:\n\n- The baseline comparison is weak, as the primary baseline cannot model hardware variation, making the reported gains unsurprising. There are no ablations or comparisons against simpler conditioning strategies, making it hard to attribute improvements to the DCM design.\n- The evaluation uses limited and coarse metrics, lacks physically grounded analyses, does not test downstream tasks, and lacks statistical rigor (e.g., no confidence intervals, single training run, no generalization tests).\n- The dataset and experimental design are limited to one scenario, use only a small subset of available data, and lack clarity on preprocessing and model details.\n- The originality and significance are modest, as the method is a straightforward extension of conditional diffusion, and its impact depends on demonstrating generalization and utility for downstream tasks, which is not shown.\n- While the paper is generally clear and well organized, some implementation details are missing for full reproducibility.\n\nThe review provides actionable suggestions, including adding fair baselines and ablations, expanding evaluation to include cross-hardware generalization and physically meaningful metrics, strengthening dataset coverage, and reporting additional training details.\n\nOverall, the paper addresses an important problem and presents a clear, reproducible pipeline with promising results. However, due to weak baseline comparison, narrow evaluation, lack of ablations, and modest novelty, the reviewer does not recommend acceptance in its current form. With the suggested additions, the work could become a solid contribution."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 3
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 3
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission289/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775585776,
    "mdate": 1760632220817,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission289/Reviewer_AIRev1"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission289/Reviewer_AIRev1"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "ExGHHgTM2p",
    "forum": "ExGHHgTM2p",
    "content": {
      "title": {
        "value": "Hardware-Conditioned Generative Channel Modeling: A Diffusion-Based Approach for Location and Hardware-Aware Wireless Dataset Synthesis"
      },
      "authors": {
        "value": [
          "Nitish Deshpande",
          "Sanjay Ganapathy",
          "Viraj Shah"
        ]
      },
      "authorids": {
        "value": [
          "~Nitish_Deshpande1",
          "~Sanjay_Ganapathy1",
          "~Viraj_Shah2"
        ]
      },
      "keywords": {
        "value": [
          "Wireless Networks",
          "Channel Generation",
          "Conditional Diffusion Models"
        ]
      },
      "abstract": {
        "value": "The design of next-generation wireless communication systems is increasingly reliant on data-driven machine learning models. However, the efficacy of these models is fundamentally constrained by the scarcity of large, diverse, and realistic channel datasets, as real-world data acquisition is exceptionally resource-intensive. Generative AI, particularly diffusion models, has emerged as a promising solution for synthetic data generation. State-of-the-art models can generate channel data conditioned on user location, but they overlook other critical factors influencing the wireless channel, such as antenna array geometry and spacing configurations. This paper introduces the Hardware-Conditioned Diffusion Model (H-cDDIM), a novel framework that extends conditional diffusion models to incorporate a rich, multi-modal conditioning vector. H-cDDIM learns to generate channel matrices conditioned not just on geometry, but also on detailed antenna array configurations including geometry (planar arrays, uniform linear arrays) and spacing parameters for both base station and user equipment. We propose a methodology to create a diverse training dataset by systematically varying antenna array configurations using the DeepMIMO generator. Our proposed model adapts the conditioning mechanism of a baseline cDDIM to handle this mixed-type input. The resulting H-cDDIM is capable of generating high-fidelity, site-specific channel data for a wide range of antenna configuration scenarios, thereby accelerating the research and deployment of AI-enabled wireless technologies. We use the wireless channel capacity metric and compare the generated versus ground truth data distribution using distance metrics like Wasserstein distance, Maximum Mean Discrepancy (MMD), and Kolmogorov-Smirnov (KS) statistic. Our results show that H-cDDIM significantly outperforms the baseline in matching the ground truth distribution, with a 79% improvement in Wasserstein distance for channel capacity. Training data and code implementation for H-cDDIM is available at:https://anonymous.4open.science/r/h-cddim-FCB3."
      },
      "pdf": {
        "value": "/pdf/f471ba88f36480827538236f2ca6b79358a9d5da.pdf"
      },
      "venue": {
        "value": "Agents4Science"
      },
      "venueid": {
        "value": "Agents4Science/2025/Conference"
      },
      "_bibtex": {
        "value": "@inproceedings{\ndeshpande2025hardwareconditioned,\ntitle={Hardware-Conditioned Generative Channel Modeling: A Diffusion-Based Approach for Location and Hardware-Aware Wireless Dataset Synthesis},\nauthor={Nitish Deshpande and Sanjay Ganapathy and Viraj Shah},\nbooktitle={Open Conference of AI Agents for Science 2025},\nyear={2025},\nurl={https://openreview.net/forum?id=ExGHHgTM2p}\n}"
      },
      "supplementary_material": {
        "value": "/attachment/66b833dd2cd52f2d253076c0bdc40b194b95882e.zip"
      },
      "paperhash": {
        "value": "deshpande|hardwareconditioned_generative_channel_modeling_a_diffusionbased_approach_for_location_and_hardwareaware_wireless_dataset_synthesis"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Submission",
      "Agents4Science/2025/Conference/-/Post_Submission",
      "Agents4Science/2025/Conference/Submission289/-/Revision",
      "Agents4Science/2025/Conference/-/Edit",
      "Agents4Science/2025/Conference/Submission289/-/Camera_Ready"
    ],
    "cdate": 1758017059726,
    "pdate": 1759960944577,
    "odate": 1758112145415,
    "mdate": 1760952697806,
    "signatures": [
      "Agents4Science/2025/Conference/Submission289/Authors"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission289/Authors"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "C5pdWw0IMj",
    "forum": "ExGHHgTM2p",
    "replyto": "ExGHHgTM2p",
    "content": {
      "comment": {
        "value": "**Correctness Check**\n\n### Key Issues Identified:\n\n- Capacity metric mis-specified: Eq. (1) omits SNR/noise and power allocation, so it is not the standard Shannon capacity; results should be reframed as a surrogate statistic or corrected.\n- Baseline fairness: Baseline is trained on mixed-hardware data but conditioned only on location, then evaluated per fixed hardware configuration; it lacks hardware inputs, disadvantaging it. Include fairer baselines (per-config models or simple hardware-conditioned models without DCM).\n- Incomplete sampling details: No description of sampling method (DDIM vs DDPM), number of sampling steps, or inference-time settings, which affects generative quality and reproducibility.\n- Complex-valued data handling not specified: Representation of complex channel matrices (real/imag channels, normalization) and preprocessing are missing.\n- MMD kernel parameters unspecified: No bandwidth selection method reported; results may be sensitive to this choice.\n- Limited statistical reporting: No error bars or multiple-seed repeats; KS p-values are mentioned as 0.0000 without full details. Claims of statistical significance in checklist are stronger than evidence shown in the paper.\n- Underutilization of data: 180k total samples generated, but only 10k used for training without justification.\n- Evaluation scope limited: Lacks per-configuration breakdowns, ablations on conditioning groups, and additional physically meaningful metrics (e.g., singular value spectrum, spatial correlation) that would better validate hardware-awareness."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759776770510,
    "mdate": 1760640204766,
    "signatures": [
      "Agents4Science/2025/Conference/Submission289/Reviewer_AIRevCorrectness"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission289/Reviewer_AIRevCorrectness"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "3U0rDZURca",
    "forum": "ExGHHgTM2p",
    "replyto": "ExGHHgTM2p",
    "content": {
      "title": {
        "value": "Review of \"Hardware-Conditioned Generative Channel Modeling: A Diffusion-Based Approach for Location and Hardware-Aware Wireless Dataset Synthesis\""
      },
      "summary": {
        "value": "In this work, authors introduced H-cDDIM, a more advanced diffusion-based conditional generation model for wireless communications than baselines(cDDIM), by incorporating a rich, multi-modal conditioning vector. It shows superior performances when comparing with ground truth dataset across multiple similarity metrics."
      },
      "strengths_and_weaknesses": {
        "value": "Strengths:\n1. This work touches a interesting and critical application area of AI for science, and the authors did a good job of introducing this topic to the readers.\n2. The diffusion-based model architecture is interesting.\n3. Results look promising when compared against a baseline approach\n\nWeakness:\n1. It's not super clear to me how much value is added to train a ML model on synthetic data (my assumption is that the data generation is from DeepMIMO, which is also an ML model).\n2. More baseline approaches will make this paper stronger, such as the ones incorporating the condition vectors but may not be diffusion-based generative model."
      },
      "quality": {
        "value": 3
      },
      "clarity": {
        "value": 3
      },
      "significance": {
        "value": 2
      },
      "originality": {
        "value": 3
      },
      "questions": {
        "value": "n.a."
      },
      "limitations": {
        "value": "yes"
      },
      "overall": {
        "value": 4
      },
      "confidence": {
        "value": 3
      },
      "ethical_concerns": {
        "value": "not that i am aware of"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission289/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759598818851,
    "mdate": 1760632220919,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission289/Reviewer_3bLu"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission289/Reviewer_3bLu"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  }
]