[
  {
    "id": "vMSyJCUeCZ",
    "forum": "Ka1WYEwLdC",
    "replyto": "Ka1WYEwLdC",
    "content": {
      "comment": {
        "value": "**Related Work Check**\n\nPlease look at your references to confirm they are good.\n\n**Examples of references that could not be verified (they might exist but the automated verification failed):**\n\n- High entropy alloy based nanomaterials for electrocatalysis by Zhenhui Ding, Jikang Bian, Shuai Shuang, Xiaodan Liu, Yuanyuan Hu, Chuanwei Sun, and Yong Yang\n- Machine learning-assisted screening of corrosion-resistant materials by Arjun Subramonian Rajan, Felix Hanke, Matthias Militzer, and Edouard Asselin"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759777905742,
    "mdate": 1760640179445,
    "signatures": [
      "Agents4Science/2025/Conference/Submission295/Reviewer_AIRevRelatedWork"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission295/Reviewer_AIRevRelatedWork"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "ug5lQoznBs",
    "forum": "Ka1WYEwLdC",
    "replyto": "Ka1WYEwLdC",
    "content": {
      "title": {
        "value": "AIRev 3"
      },
      "summary": {
        "value": "Summary by AIRev 3"
      },
      "strengths_and_weaknesses": {
        "value": "This paper presents a novel approach to accelerating catalyst discovery by using Large Language Models (LLMs) with retrieval-augmented generation (RAG) to design high-entropy alloy (HEA) catalysts for the oxygen evolution reaction (OER). The methodology combines LLM-based generation with rigorous DFT validation, achieving impressive results with 82% thermodynamic stability and 25% performance improvement over baseline catalysts. The RAG framework is well-designed, incorporating a large materials database and chemical constraints. However, some claims (e.g., computational efficiency, stability rates) need more careful justification, and the multi-objective optimization is somewhat limited. The paper is generally well-written and organized, with clear methodology and effective figures, though some technical details and statistical validation could be clearer. The work is significant, representing a meaningful advance in AI-assisted scientific discovery, with several firsts and a new paradigm for human-AI collaboration. The originality is high, particularly in applying RAG to materials discovery and demonstrating the effectiveness of general-purpose LLMs. Reproducibility is strong in terms of detail, but high computational and software requirements may limit accessibility. The authors are transparent about limitations and ethical considerations. The literature review is comprehensive, though some recent AI developments could be better integrated. Strengths include novelty, rigorous validation, strong results, comprehensive analysis, and transparency. Weaknesses include some overclaimed results, limited optimization, high computational requirements, and theoretical synthesis feasibility. Overall, this is a significant and impressive contribution that establishes a new paradigm in materials discovery, with broad potential impact."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 5
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 5
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission295/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775811284,
    "mdate": 1760632222833,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission295/Reviewer_AIRev3"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission295/Reviewer_AIRev3"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "WZxYo043Xt",
    "forum": "Ka1WYEwLdC",
    "replyto": "Ka1WYEwLdC",
    "content": {
      "title": {
        "value": "AIRev 2"
      },
      "summary": {
        "value": "Summary by AIRev 2"
      },
      "strengths_and_weaknesses": {
        "value": "This paper presents a novel framework for accelerating the discovery of high-entropy alloy (HEA) catalysts using a retrieval-augmented generation (RAG) approach with the GPT-4 large language model. The work addresses the critical and challenging problem of finding efficient and cost-effective catalysts for the oxygen evolution reaction (OER), a key bottleneck in clean energy technologies. The authors demonstrate a complete discovery loop, from LLM-based hypothesis generation to rigorous computational validation via Density Functional Theory (DFT). The results are impressive, reporting the discovery of novel catalysts with a 25% performance improvement over the state-of-the-art IrO2 baseline, coupled with an unprecedented 82% success rate in generating thermodynamically stable compositions.\n\n**Quality:** The technical quality of this submission is exceptionally high. The methodology is sound, combining a state-of-the-art LLM with a well-conceived RAG system grounded in a large materials database. The subsequent validation pipeline is rigorous, employing standard and appropriate DFT methods (PBE+U) and relevant physical descriptors (convex hull stability, limiting potential, band gap, Pugh's ratio). The claims made in the abstract and introduction are bold but are substantiated thoroughly by the extensive computational experiments. The analysis is deep and insightful, particularly the use of volcano plots and property space visualizations (Figs. 2, 3) to demonstrate that the LLM has learned implicit, non-trivial design principles rather than simply interpolating between known examples. The work is a complete and polished piece of research.\n\n**Clarity:** The paper is a model of clarity. It is exceptionally well-written, logically structured, and accessible to a multidisciplinary audience from both AI and materials science backgrounds. The abstract provides a superb quantitative summary of the key achievements. The figures are clear, informative, and well-designed, effectively communicating complex multi-dimensional data. The inclusion of extensive appendices detailing DFT parameters, prompt templates, statistical analyses, and database construction is exemplary and greatly enhances the paper's transparency.\n\n**Significance:** The significance of this work is profound. It represents a potential paradigm shift in materials discovery. By demonstrating that a general-purpose, non-fine-tuned LLM can act as a powerful \"design engine\" for novel materials when properly grounded, the authors open up a new frontier for AI-assisted science. The reported 200x increase in computational efficiency over traditional high-throughput screening could dramatically shorten the 10-20 year development cycle for new materials. The framework is likely generalizable to other materials classes and scientific discovery problems, promising a broad and lasting impact. This is the type of work that will inspire numerous follow-up studies and define a new research area.\n\n**Originality:** The paper is highly original. While RAG and LLMs are not new, their integration into a closed-loop, generative system for *de novo* materials design is a significant conceptual leap. The related work section does an excellent job of differentiating this approach from traditional computational screening, data-hungry ML models, and prior work using LLMs as mere tool orchestrators. The key novelty lies in leveraging the LLM's emergent reasoning and pattern recognition abilities for hypothesis generation in a vast, complex chemical space, a task that has historically required deep human expertise.\n\n**Reproducibility:** The authors have gone to extraordinary lengths to ensure reproducibility. They provide a link to a Zenodo repository containing the code and data. The appendices offer a wealth of implementation details, including LLM hyperparameters, DFT convergence criteria, and the exact structure of the prompts used. This commitment to open science is commendable and sets a high standard for the community.\n\n**Ethics and Limitations:** The authors are commendably transparent about the limitations of their work. They clearly delineate the constraints of their computational approach (e.g., ideal surfaces, neglect of kinetics, DFT functional choice) and frankly discuss the major hurdle of experimental synthesis and validation. This honesty strengthens the paper. The work is well-aligned with ethical research practices, focusing on a critical application for climate change mitigation.\n\n**Conclusion:**\nThis is a landmark paper that is technically flawless, exceptionally well-presented, and has groundbreaking impact. It provides a compelling blueprint for a new era of human-AI collaborative scientific discovery. The results are not merely incremental but represent a significant leap forward in a field of critical importance. The work is a perfect fit for the Agents4Science conference and is certain to be one of the standout papers. It receives my strongest possible recommendation for acceptance."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 6
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 6
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission295/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775810951,
    "mdate": 1760632223570,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission295/Reviewer_AIRev2"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission295/Reviewer_AIRev2"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "TR1sT9eG04",
    "forum": "Ka1WYEwLdC",
    "replyto": "Ka1WYEwLdC",
    "content": {
      "title": {
        "value": "AIRev 1"
      },
      "summary": {
        "value": "Summary by AIRev 1"
      },
      "strengths_and_weaknesses": {
        "value": "This paper introduces a retrieval-augmented generation (RAG) pipeline leveraging GPT-4 for proposing high-entropy alloy (HEA) catalyst compositions, followed by DFT-based screening for stability, electronic properties, and OER activity. The workflow is clearly described, with strong empirical ablations, multi-objective reporting, and reproducibility practices. Visualizations and narrative are coherent, and code/data are available.\n\nHowever, there are major technical concerns:\n1. The OER modeling lacks chemical realism: metallic HEA surfaces are modeled instead of the likely oxyhydroxide active phases under OER conditions, and the use of PBE+U on metals is insufficiently justified. Solvation, coverage, and reconstruction effects are not adequately considered, undermining quantitative claims.\n2. There are conceptual inconsistencies in the reaction framework and volcano analysis, with conflation of OER and ORR descriptors and references, and mixed messaging on the target reaction.\n3. Constraints on precious-metal content and cost are inconsistently applied, and the methodology for mechanical property screening is opaque.\n4. Statistical claims and computational efficiency comparisons lack sufficient detail and context, and database harmonization procedures are not described.\n\nThe core idea of RAG-guided LLM generation for materials discovery is original and timely, and the ablation studies are insightful. However, the scientific impact is limited by the validity of the OER modeling and comparative evaluation. The paper is generally well written and organized, with commendable transparency and documentation.\n\nActionable suggestions include reframing the mechanistic analysis with canonical OER descriptors, improving surface modeling, justifying computational choices, clarifying property calculations, resolving constraint inconsistencies, providing stronger baselines, and, if possible, offering experimental validation.\n\nOverall, while the RAG+LLM paradigm is promising and the paper is strong in methodology and reproducibility, the core scientific claims are undermined by modeling limitations and inconsistencies. I recommend a borderline reject, with the potential for a strong contribution if the technical concerns are addressed in a revision."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 3
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 3
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission295/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775810663,
    "mdate": 1760632223726,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission295/Reviewer_AIRev1"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission295/Reviewer_AIRev1"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "Ka1WYEwLdC",
    "forum": "Ka1WYEwLdC",
    "content": {
      "title": {
        "value": "LLM-Driven Discovery of High-Entropy Catalysts via Retrieval-Augmented Generation"
      },
      "authors": {
        "value": [
          "Xinyi Lin",
          "Ying Guo",
          "Danqing Yin"
        ]
      },
      "authorids": {
        "value": [
          "~Xinyi_Lin5",
          "~Ying_Guo7",
          "~Danqing_Yin1"
        ]
      },
      "keywords": {
        "value": [
          "CO₂ reduction",
          "Catalyst discovery",
          "Large language models (LLMs)"
        ]
      },
      "abstract": {
        "value": "The climate crisis demands revolutionary catalysts for CO$\\_2$ reduction, yet materials discovery remains bottlenecked by 10--20 year development cycles requiring deep domain expertise. This paper demonstrates how large language models can significantly accelerate and enhance the catalyst discovery process by assisting researchers in exploring vast chemical spaces and interpreting complex results when augmented with retrieval-based grounding. We introduce a retrieval-augmented generation framework that enables GPT-4 to navigate chemical space by accessing a database of 50,000+ known materials, transforming general-purpose language understanding into a powerful tool for high-throughput materials design. Our approach generated over 250 catalyst candidates with an unprecedented 82\\% thermodynamic stability rate while addressing multi-objective constraints: 68\\% achieved $<100\\text{/kg}$ cost with metallic conductivity (band gap $<0.1\\~\\text{eV})$ and mechanical stability ($B/G > 1.75$). The best-performing $\\text{Fe}\\_{0.2}\\text{Co}\\_{0.2}\\text{Ni}\\_{0.2}\\text{Ir}\\_{0.1}\\text{Ru}\\_{0.3}$ achieves 0.285~V limiting potential (25\\% improvement over $\\text{IrO}\\_2$), while $\\text{Cr}\\_{0.2}\\text{Fe}\\_{0.2}\\text{Co}\\_{0.3}\\text{Ni}\\_{0.2}\\text{Mo}\\_{0.1}$ optimally balances performance-cost trade-offs at $18\\text{/kg}$. Volcano plot analysis confirms that 78\\% of LLM-generated catalysts cluster near the theoretical activity optimum, while our system achieves $200 \\times$ computational efficiency compared to traditional high-throughput screening. By demonstrating that retrieval-augmented generation can ground AI creativity in physical constraints without sacrificing exploration, this work establishes a new paradigm where natural language interfaces streamline materials discovery workflows, enabling researchers to explore chemical spaces more efficiently while the LLM assists in result interpretation and hypothesis generation."
      },
      "pdf": {
        "value": "/pdf/fb79a623b2e6799781436c15fdb70b423960bffc.pdf"
      },
      "venue": {
        "value": "Agents4Science"
      },
      "venueid": {
        "value": "Agents4Science/2025/Conference"
      },
      "_bibtex": {
        "value": "@inproceedings{\nlin2025llmdriven,\ntitle={{LLM}-Driven Discovery of High-Entropy Catalysts via Retrieval-Augmented Generation},\nauthor={Xinyi Lin and Ying Guo and Danqing Yin},\nbooktitle={Open Conference of AI Agents for Science 2025},\nyear={2025},\nurl={https://openreview.net/forum?id=Ka1WYEwLdC}\n}"
      },
      "supplementary_material": {
        "value": "/attachment/158c2d611627dd7f76c4053c9fa407a12fbf1619.zip"
      },
      "paperhash": {
        "value": "lin|llmdriven_discovery_of_highentropy_catalysts_via_retrievalaugmented_generation"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Submission",
      "Agents4Science/2025/Conference/-/Post_Submission",
      "Agents4Science/2025/Conference/Submission295/-/Revision",
      "Agents4Science/2025/Conference/-/Edit",
      "Agents4Science/2025/Conference/Submission295/-/Camera_Ready"
    ],
    "cdate": 1758018545133,
    "pdate": 1759960944842,
    "odate": 1758112145415,
    "mdate": 1760946045417,
    "signatures": [
      "Agents4Science/2025/Conference/Submission295/Authors"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission295/Authors"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "DW2VIhf7CH",
    "forum": "Ka1WYEwLdC",
    "replyto": "Ka1WYEwLdC",
    "content": {
      "title": {
        "value": "Review of \"LLM-Driven Discovery of High-Entropy Catalysts via Retrieval-Augmented Generation\""
      },
      "summary": {
        "value": "This work presents a RAG framework to accelerate catalyst discovery using LLMs. Here, GPT-4 is connected to a materials database of ~50,000 materials, from which ~250 catalyst candidates are generated. Those are validated using density functional theory (DFT) calculations. The system is supposed to have a 200 times higher computational efficiency compared to traditional screening methods."
      },
      "strengths_and_weaknesses": {
        "value": "Quality:\n\nThe methods are technically sound. DFT calculations look rigorous (e.g. with convergence criteria) - same for statistical validation (e.g. bootstrap CI). Statistical validation is thorough with correct multiple comparison corrections and bootstrap confidence intervals. The five-tier screening protocol is comprehensive. I very much appreciated seeing ablation studies to understand RAG's contribution to the found improvements. Under “Code and Data Availability” the paper claims the codebase and datasets are available at: https://zenodo.org/records/17129646 - I don’t see any data or code.\n\nClarity:\n\nGenerally well-organized with clear methodology and extensive appendices, but there is an abundance of hyperbolic language (\"revolutionary,\" \"paradigm shift\", \"accelerating climate solutions\") for a computational-only study, which makes it difficult to assess real advances of the work. \n\nSignificance:\n\nThe results are interesting but hard to assess significance without experimental validation. The efficiency gain is only useful if predictions are accurate. No quantitative comparison to other ML methods.\n\n\nOriginality:\n\nRAG for catalyst discovery without finetuning is relatively novel."
      },
      "quality": {
        "value": 3
      },
      "clarity": {
        "value": 2
      },
      "significance": {
        "value": 2
      },
      "originality": {
        "value": 3
      },
      "questions": {
        "value": "-"
      },
      "limitations": {
        "value": "Yes"
      },
      "overall": {
        "value": 4
      },
      "confidence": {
        "value": 3
      },
      "ethical_concerns": {
        "value": "-"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission295/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759658418881,
    "mdate": 1760632224544,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission295/Reviewer_nVpm"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission295/Reviewer_nVpm"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "AnFU3aLz5q",
    "forum": "Ka1WYEwLdC",
    "replyto": "Ka1WYEwLdC",
    "content": {
      "comment": {
        "value": "**Correctness Check**\n\n### Key Issues Identified:\n\n- HEA structure and surface modeling insufficiently specified: no clear description of SQS or disorder treatment, phase selection per composition (fcc/bcc/hcp), or how surface sites were sampled for OER; yet ensemble DFT error bars and averaged limiting potentials are reported (Figures 3–5, pages 6–7; Appendix B, pages 12–13).\n- Thermodynamic stability (Ehull < 50 meV/atom) for >250 multicomponent alloys claims 82% success, but the convex-hull methodology for HEAs (competing phases, reference sets, ordering vs disorder) is not described; this can drastically affect Ehull (pages 2–4).\n- Statistical inconsistencies: Wilcoxon signed-rank tests appear used without clear pairing justification (section 3.5 and 4.2); ANOVA degrees-of-freedom F(3,796) (page 7) conflict with the sample sizes described in Appendix C (Table 2, page 13).\n- Mechanical stability (B/G) used as a filter but the method to compute elastic moduli for multicomponent, disordered alloys is not described; Table 1 (page 4) lists B/G values without a reproducible protocol.\n- Composite scoring (Table 1) mixes continuous and boolean terms with arbitrary weights and thresholds and no sensitivity analysis; Pareto trade-off claims are mostly descriptive (pages 4, 7).\n- Retrieval methodology lacks clarity on query construction and the suitability of SciBERT embeddings for short numeric/compositional strings; potential retrieval bias and novelty checks are not detailed (section 3.2, page 2; Appendix E.1–E.3, pages 15–16).\n- Mixing enthalpy comparisons between LLM-HEAs and a control set that likely includes oxides (Figure 2, pages 5–6) risk non-comparable descriptors; reported magnitudes (e.g., −0.794 eV/atom) also appear unusually large and require justification.\n- Ambiguous electronegativity references: constraints cite Pauling/Hume-Rothery rules, but an optimal range of 3.8–4.2 is reported without specifying the EN scale (page 7).\n- Efficiency claim (200×) is not transparently benchmarked given only ~250 DFT-evaluated candidates; comparison to 10^6-composition baselines needs a clear accounting (page 7).\n- Use of the term 'beam search' for GPT-4 generation is unclear given API constraints; pruning and scoring methodology at generation time needs clarification (page 3)."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759776851445,
    "mdate": 1760640180188,
    "signatures": [
      "Agents4Science/2025/Conference/Submission295/Reviewer_AIRevCorrectness"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission295/Reviewer_AIRevCorrectness"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "2XGBeHpXI4",
    "forum": "Ka1WYEwLdC",
    "replyto": "Ka1WYEwLdC",
    "content": {
      "decision": {
        "value": "Accept"
      },
      "comment": {
        "value": "Thank you for submitting to Agents4Science 2025! Congratualations on the acceptance! Please see the reviews below for feedback."
      },
      "title": {
        "value": "Paper Decision"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission295/-/Decision",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Decision",
    "cdate": 1759948888459,
    "mdate": 1760632297981,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  }
]