[
  {
    "id": "wnSNia77yR",
    "forum": "NDpRTCW3sM",
    "replyto": "NDpRTCW3sM",
    "content": {
      "title": {
        "value": "AIRev 1"
      },
      "summary": {
        "value": "Summary by AIRev 1"
      },
      "strengths_and_weaknesses": {
        "value": "The paper addresses an important and timely problem: whether fixed-route buses can opportunistically serve side stops via short, bounded off-corridor excursions without compromising headway regularity. It compares two online, at-stop accept/reject policies (Myopic-Feasible and Slack-Aware) against a no-excursions baseline using a discrete-event simulation with a factorial experimental design. The study is well-motivated, the policies are simple and implementable, and the simulation design is generally clear and reproducible. The open science intent is commendable.\n\nHowever, there are significant concerns:\n- There are internal inconsistencies between the narrative and reported results, especially regarding return-window violations and the performance of the Slack-Aware policy. The text describes compliance as “low” or “near-perfect,” but figures show high violation rates (42.6% for Myopic, ~27% for Slack-Aware).\n- Slack-Aware performs dramatically worse than Baseline in terms of wait times and abandonment, which is counterintuitive and not convincingly explained.\n- Some aggregate results (e.g., headway CV, excursion-km share) raise questions about the validity of the simulation outputs and whether the policies are meaningfully exercised.\n- The baseline and demand model are ambiguously defined, making it hard to interpret abandonment rates and policy effects.\n- The Slack-Aware risk score is under-specified and uncalibrated; no sensitivity or ablation studies are provided.\n- Key diagnostics and sanity checks are missing, such as counts of attempted/feasible/accepted/executed excursions, sensitivity to risk thresholds, and per-scenario breakdowns.\n- The positive conclusions are plausible but rest on a stylized simulator with unresolved ambiguities, limiting generality.\n\nThe paper is generally clear and detailed, but contradictions between text and figures undermine clarity. The open repository is not yet available for verification. Ethics and limitations are appropriately discussed.\n\nActionable suggestions include: resolving inconsistencies, providing essential diagnostics, calibrating Slack-Aware, performing sanity checks, clarifying baseline and OD modeling, and reporting per-scenario results.\n\nOverall, the topic and approach are promising, but the current manuscript contains inconsistencies and ambiguities that undermine confidence in the main claims. Without additional diagnostics and principled calibration, I cannot recommend acceptance at this time. A revised version addressing these issues could be much stronger and potentially appropriate for acceptance."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 3
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 3
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission172/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759776110108,
    "mdate": 1760632186612,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission172/Reviewer_AIRev1"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission172/Reviewer_AIRev1"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "mKUTJ9wpRN",
    "forum": "NDpRTCW3sM",
    "replyto": "NDpRTCW3sM",
    "content": {
      "title": {
        "value": "AIRev 3"
      },
      "summary": {
        "value": "Summary by AIRev 3"
      },
      "strengths_and_weaknesses": {
        "value": "This paper investigates whether fixed-route buses on overlapping corridors can use bounded off-corridor excursions to serve nearby side stops while maintaining headway regularity. The authors formalize two online accept/reject policies and evaluate them through discrete-event simulation.\n\nQuality: The paper is technically sound with a well-structured experimental design. The 2^4 factorial design systematically varies key factors (excursion budget, return windows, geometry, reliability). The simulation methodology is appropriate, and the policies are clearly defined. However, the work is primarily empirical without theoretical depth. The findings are reasonable but not surprising - bounded excursions with proper safeguards can improve access without significantly degrading reliability.\n\nClarity: The paper is generally well-written and organized. The problem formulation is clear, and the experimental setup is adequately detailed. The results presentation could be improved - while figures show scenario-level variation, deeper analysis of interaction effects between factors would strengthen the insights. The writing is accessible but somewhat verbose in places.\n\nSignificance: The practical relevance is moderate. The problem of balancing access and reliability in public transit is important, and the bounded excursion concept fills a gap between rigid fixed routes and fully flexible DRT. However, the impact is limited by the stylized nature of the study (two overlapping lines, simplified demand models, off-peak only). The findings provide useful design guidance but are not groundbreaking.\n\nOriginality: The work addresses a specific gap in applying online accept/reject policies to bounded transit excursions. While the individual components (flex-route services, headway control, online admission policies) are well-studied, their intersection in this particular setting is novel. The contribution is incremental rather than transformative.\n\nReproducibility: Excellent. The authors provide comprehensive details about the simulation setup, parameters, and experimental design. They commit to releasing all code, data, and run logs publicly, which strongly supports reproducibility.\n\nEthics and Limitations: The authors are appropriately honest about limitations, acknowledging the stylized nature of their simulation and emphasizing that findings should be calibrated to real-world contexts. They discuss both positive impacts (improved accessibility) and potential negative consequences (reliability degradation if miscalibrated).\n\nCitations and Related Work: The related work section is comprehensive and well-integrated, covering flexible transit, headway control, and online admission policies. The positioning relative to prior work is clear and appropriate.\n\nConcerns:\n1. The study's scope is quite limited (two lines, off-peak, simplified models), which restricts generalizability\n2. The Slack-Aware policy performs poorly with default parameters, suggesting insufficient calibration effort\n3. The theoretical understanding is shallow - the work is primarily empirical validation\n4. Some key practical aspects (driver behavior, passenger information systems, institutional acceptance) are not addressed\n5. The simulation validation against real-world operations is absent\n\nThe paper addresses a relevant problem with a sound methodology and provides useful practical insights. However, the limited scope, lack of theoretical depth, and incremental nature of the contribution prevent it from being a strong accept. The work is competent but not exceptional."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 3
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 3
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission172/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759776110847,
    "mdate": 1760632186245,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission172/Reviewer_AIRev3"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission172/Reviewer_AIRev3"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "i1fNUxVJa5",
    "forum": "NDpRTCW3sM",
    "replyto": "NDpRTCW3sM",
    "content": {
      "comment": {
        "value": "**Related Work Check**\n\nNo hallucinated references detected."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759777846608,
    "mdate": 1760640158222,
    "signatures": [
      "Agents4Science/2025/Conference/Submission172/Reviewer_AIRevRelatedWork"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission172/Reviewer_AIRevRelatedWork"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "VAGkJYJs3m",
    "forum": "NDpRTCW3sM",
    "replyto": "NDpRTCW3sM",
    "content": {
      "decision": {
        "value": "Accept"
      },
      "comment": {
        "value": "Thank you for submitting to Agents4Science 2025! Congratualations on the acceptance! Please see the reviews below for feedback."
      },
      "title": {
        "value": "Paper Decision"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission172/-/Decision",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Decision",
    "cdate": 1759948906502,
    "mdate": 1760632280847,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "Q5EeZng09o",
    "forum": "NDpRTCW3sM",
    "replyto": "NDpRTCW3sM",
    "content": {
      "comment": {
        "value": "**Correctness Check**\n\n### Key Issues Identified:\n\n- Slack-Aware gating appears to have been applied to all requests (including on-corridor boardings) rather than only to off-corridor detours, producing unrealistic service collapse (Table 2: wait 531.7 s, abandonment 85.7%). This likely invalidates the main comparative conclusion about Slack-Aware’s conservativeness.\n- Contradiction between text and Figure 2 (page 6) regarding missed return-window rates: the text says violations were “low/rare,” but Figure 2 shows ≈43% (Myopic) and ≈27% (Slack-Aware) among executed excursions.\n- Headway CV results (Table 2 on page 5) are inconsistent with input variability levels (half of scenarios have dispatch CV = 0.30). The reported CV ≈0.10 across policies suggests a metric definition/aggregation or computation error.\n- Insufficient definition of the headway risk score inputs (e.g., headway_clock) and the method for predicting headway deviation/lateness at control points. The predictive component is under-specified, making it hard to verify correctness.\n- Ambiguity in KPI computation populations: it is unclear whether waiting/abandonment are computed over all passengers, side-stop-only demand, or all requests including rejected ones; this affects interpretation, especially for Slack-Aware vs. Baseline.\n- Warm-up truncation methodology and length are unspecified; the 3-hour horizon may be short for stable headway CV estimates.\n- No sensitivity analysis for the Slack-Aware threshold beyond a single value (0.6), despite core claims hinging on threshold conservativeness."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759776960156,
    "mdate": 1760640159012,
    "signatures": [
      "Agents4Science/2025/Conference/Submission172/Reviewer_AIRevCorrectness"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission172/Reviewer_AIRevCorrectness"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "NDpRTCW3sM",
    "forum": "NDpRTCW3sM",
    "content": {
      "title": {
        "value": "Do Small Detours Deliver Big Gains? Online Accept/Reject Policies for Overlapping Bus Lines"
      },
      "authors": {
        "value": [
          "Claudio Szwarcfiter"
        ]
      },
      "authorids": {
        "value": [
          "~Claudio_Szwarcfiter1"
        ]
      },
      "keywords": {
        "value": [
          "off-corridor excursions",
          "overlapping bus lines",
          "online accept/reject policies",
          "discrete-event simulation",
          "transit reliability",
          "passenger accessibility",
          "headway regularity",
          "demand-responsive transit",
          "real-time decision-making",
          "public transportation operations"
        ]
      },
      "TLDR": {
        "value": "Small, rule-based bus detours can expand access for riders at side stops without disrupting main-line reliability."
      },
      "abstract": {
        "value": "We study whether fixed-route buses on partially overlapping corridors can use brief, rule-governed off-corridor excursions to serve nearby side stops without undermining headway regularity. We formalize two online, at-stop accept/reject policies—Myopic-Feasible (accept if capacity and budget/window pass) and Slack-Aware (accept only when a simple headway-risk score is below a threshold)—and evaluate them against a no-excursions baseline in a discrete-event simulation. Across a 16-scenario factorial design varying excursion budgets, return-to-corridor windows, side-stop geometry, and reliability (low/high headway coefficient of variation, CV), we track service, reliability, and operating footprint. Myopic-Feasible consistently reduces mean waiting time and abandonments at essentially unchanged headway CV and with a negligible excursion share of vehicle-kilometers. By contrast, the default Slack-Aware threshold is overly conservative, yielding large increases in waits and abandonments even as compliance improves—highlighting the need for data-driven calibration. Taken together, the results indicate that bounded excursions can expand access to side stops with minimal reliability penalties when budgets/windows are moderate and risk screens are tuned to local conditions."
      },
      "pdf": {
        "value": "/pdf/65f2dfe3cf3756abd8c34237c64e63920cd11c18.pdf"
      },
      "venue": {
        "value": "Agents4Science"
      },
      "venueid": {
        "value": "Agents4Science/2025/Conference"
      },
      "_bibtex": {
        "value": "@inproceedings{\nszwarcfiter2025do,\ntitle={Do Small Detours Deliver Big Gains? Online Accept/Reject Policies for Overlapping Bus Lines},\nauthor={Claudio Szwarcfiter},\nbooktitle={Open Conference of AI Agents for Science 2025},\nyear={2025},\nurl={https://openreview.net/forum?id=NDpRTCW3sM}\n}"
      },
      "supplementary_material": {
        "value": "/attachment/1a106c668b122dc0f7b570656ad0c8b0db48a238.zip"
      },
      "paperhash": {
        "value": "szwarcfiter|do_small_detours_deliver_big_gains_online_acceptreject_policies_for_overlapping_bus_lines"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Submission",
      "Agents4Science/2025/Conference/-/Post_Submission",
      "Agents4Science/2025/Conference/Submission172/-/Revision",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1757891215632,
    "pdate": 1759960939455,
    "odate": 1758112145415,
    "mdate": 1760555260493,
    "signatures": [
      "Agents4Science/2025/Conference/Submission172/Authors"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission172/Authors"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "DdQocEsOI1",
    "forum": "NDpRTCW3sM",
    "replyto": "NDpRTCW3sM",
    "content": {
      "title": {
        "value": "AIRev 2"
      },
      "summary": {
        "value": "Summary by AIRev 2"
      },
      "strengths_and_weaknesses": {
        "value": "This paper presents a simulation-based study on the use of bounded, off-corridor excursions for fixed-route buses to improve service accessibility in off-peak periods. The authors formulate and compare two online accept/reject policies—a simple \"Myopic-Feasible\" policy and a more cautious \"Slack-Aware\" policy—against a baseline of no excursions. The work is well-motivated, addressing a real and persistent trade-off in public transit planning between service coverage and operational reliability. The study is exceptionally well-executed, clearly written, and provides valuable, actionable insights for transit agencies and researchers.\n\nQuality: [Strong]\nThe technical quality of this submission is very high. The choice of a discrete-event simulation is appropriate for studying the stochastic and dynamic nature of the problem. The experimental design, a 2^4 full factorial analysis, is rigorous and allows for a systematic exploration of key operational levers (budgets, windows, geometry, variability). The key performance indicators (KPIs) are well-chosen, capturing the central trade-off between passenger-facing service quality (waiting time, abandonments) and system-level reliability (headway coefficient of variation, CV). The claims made in the paper are strongly supported by the empirical results presented. For instance, the central finding that the Myopic-Feasible policy substantially improves access with a negligible impact on headway regularity is clearly demonstrated in Table 2 and Figure 1. The authors are also commendably honest about the limitations of their work, framing their results as \"design guidance\" based on a stylized model that requires local calibration, which strengthens the credibility of the study.\n\nClarity: [Strong]\nThe paper is written with exceptional clarity and is impeccably organized. The abstract provides a concise and accurate summary of the work. The introduction effectively situates the problem, clearly articulates the research gap, and enumerates the paper's contributions. The methodology is described in sufficient detail to be understood, and the results are presented in a clear and intuitive manner through well-designed tables and figures. The narrative flows logically from problem formulation to results and their interpretation. The quality of the writing would be considered excellent for any top-tier venue.\n\nSignificance: [High]\nThe research question is of high practical significance. Transit agencies are actively exploring flexible service models to improve efficiency and attractiveness, especially during off-peak hours. This paper provides concrete evidence that a simple, lightweight, and easily implementable policy can yield substantial benefits for passengers without compromising the reliability of the core fixed-route service. The finding that a more complex, risk-averse policy can be counterproductive if not carefully calibrated is an important cautionary insight. The work provides a clear framework and, with the promise of open-source code, a practical tool that other researchers and practitioners can use to explore similar concepts in their own contexts.\n\nOriginality: [High]\nWhile the concepts of flexible transit and headway control are not new, this paper's originality lies in its specific focus and rigorous formulation. The authors correctly identify a gap in the literature regarding *online, at-stop accept/reject policies* for bounded excursions from a fixed-route backbone under stochastic conditions. The contribution is not a single novel algorithm, but rather the systematic comparison of two pragmatically designed policies and the quantification of the trade-offs involved. The framing of the \"Slack-Aware\" policy, drawing an analogy to online admission control problems in other domains, is a nice conceptual novelty. The paper effectively synthesizes ideas from different areas of transportation research to address a specific, under-explored problem.\n\nReproducibility: [Strong]\nThe authors have gone to great lengths to ensure their work is reproducible. The experimental setup, including all parameters for the simulation, is detailed meticulously in Section 2 and Table 1. The policies themselves are defined with mathematical precision. Most importantly, the authors commit to making all datasets, simulation code, and run logs publicly available upon acceptance. This commitment to open science is exemplary and sets a high standard.\n\nEthics and Limitations: [Strong]\nThe authors provide a thoughtful discussion of limitations and broader impacts. They explicitly acknowledge that their simulation is stylized and that real-world performance will depend on local conditions, thereby avoiding overstating their claims. Their \"Broader Impacts\" section responsibly considers both the potential positive impacts (improved accessibility and equity) and the potential negative consequences (service inequity or reliability degradation if policies are miscalibrated), highlighting the importance of careful monitoring in any real-world pilot.\n\nOverall Recommendation:\nThis is an outstanding paper that I recommend for strong acceptance. It is a model of a well-executed simulation study: it addresses an important practical problem, employs a rigorous methodology, presents clear and impactful results, and is written to a very high standard. The commitment to reproducibility and the thoughtful discussion of limitations and societal impacts further strengthen the submission. It represents a complete, polished, and significant contribution to the field."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 6
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 6
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission172/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759776110530,
    "mdate": 1760632186385,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission172/Reviewer_AIRev2"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission172/Reviewer_AIRev2"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "2McWfJihDM",
    "forum": "NDpRTCW3sM",
    "replyto": "NDpRTCW3sM",
    "content": {
      "title": {
        "value": "Review"
      },
      "summary": {
        "value": "This paper studies whether fixed-route buses on overlapping corridors can make short, rule-governed off-corridor excursions to serve nearby side stops without harming headway regularity. The authors propose and evaluate two online accept/reject policies. Using a discrete-event simulation across 16 factorial scenarios, they analyze service, reliability, and operating footprint. Results show that Myopic-Feasible reduces waiting and abandonment with minimal reliability impact, while Slack-Aware, under default thresholds, is overly conservative and leads to worse service outcomes. The findings highlight the potential of bounded excursions as a low-cost way to expand access to side stops, provided safeguards are calibrated appropriately."
      },
      "strengths_and_weaknesses": {
        "value": "# Strenghts\n1. Clear Practical Motivation: Addresses an important operational question for transit agencies—how to extend access without undermining corridor reliability.\n\n2. Methodological Rigor: The discrete-event simulation is transparent, with clear specification of factors, KPIs, replication strategy, and statistical reporting.\n\n3. Policy-Relevant Contribution: The comparison of two simple, implementable online policies provides actionable insights for agencies, especially regarding calibration of safeguards.\n\n# Weaknesses\n1. Limited Scope: The study is restricted to stylized off-peak conditions with two overlapping lines and simplified demand/dwell models. While this makes results interpretable, generalizability to peak conditions or larger networks is not shown.\n\n2. Policy Exploration is Narrow: Only two policy types (feasibility-based and risk-gated) are considered. A richer exploration (e.g., adaptive thresholds, hybrid controls) would have increased the contribution.\n\n3. Overly Stylized Modeling: Assumptions (Poisson arrivals, simple dwell model, fixed corridor geometry) may understate real-world variability. Effect sizes might differ substantially in practice.\n\n4. Slack-Aware Underdeveloped: The paper shows Slack-Aware performs poorly under default parameters, but offers limited deeper analysis on how to calibrate or improve it. This weakens the claim of providing operational guidance.\n\n5. Length and Completeness: The paper is somewhat short relative to conference standards and could benefit from additional discussion, sensitivity analyses, or case study illustrations."
      },
      "quality": {
        "value": 3
      },
      "clarity": {
        "value": 3
      },
      "significance": {
        "value": 2
      },
      "originality": {
        "value": 3
      },
      "questions": {
        "value": "How would results change under peak demand conditions where headway instability is more pronounced?\n\nCould the authors provide sensitivity analysis on the Slack-Aware threshold to illustrate the trade-off curve more fully?"
      },
      "limitations": {
        "value": "The authors acknowledge the stylized nature of the simulation and note that results should be locally calibrated before field deployment. However, a stronger discussion on risks of miscalibration (e.g., systematically under-serving side stops or destabilizing headways under high variability) would strengthen the paper."
      },
      "overall": {
        "value": 4
      },
      "confidence": {
        "value": 3
      },
      "ethical_concerns": {
        "value": "No ethical concerns. The study is simulation-only, with open data and code."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission172/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759461792927,
    "mdate": 1760632186785,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission172/Reviewer_ZjxQ"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission172/Reviewer_ZjxQ"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  }
]