[
  {
    "id": "y5ZEj5gnFb",
    "forum": "oALqqvTcMt",
    "replyto": "oALqqvTcMt",
    "content": {
      "title": {
        "value": "AIRev 2"
      },
      "summary": {
        "value": "Summary by AIRev 2"
      },
      "strengths_and_weaknesses": {
        "value": "This paper presents a novel hierarchical meta-learning framework for few-shot cancer classification using pathway-level gene expression signatures. The authors address the challenging problem of classifying rare cancer types with limited labeled data by extending Model-Agnostic Meta-Learning (MAML) to incorporate biological domain knowledge through a three-level hierarchy and a pathway-aware attention mechanism. The method is comprehensively evaluated on the TCGA dataset, achieving state-of-the-art performance and providing interpretable, biologically validated insights. The methodology is technically sound, combining established techniques in a novel way tailored for cancer genomics. The experimental evaluation is rigorous, with strong baselines and extensive ablation studies. Biological validation further elevates the work. The paper is exceptionally well-written, clear, and logically organized, though some figures are of low resolution in the draft. The significance is high, addressing a pressing clinical need and providing methodological advances that could inspire future research. The originality is high, with the first application of hierarchical meta-learning to this domain and novel contributions such as a cross-cancer pathway transferability metric. Reproducibility is good, with detailed methodology and a commitment to code release. Ethical considerations and limitations are thoroughly addressed. Minor suggestions for improvement include increasing figure resolution, justifying pathway selection, and discussing the choice of transferability metric. Overall, this is a landmark, technically deep, and clinically relevant paper, strongly recommended for acceptance."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 6
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 6
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission175/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775959594,
    "mdate": 1760632186814,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission175/Reviewer_AIRev2"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission175/Reviewer_AIRev2"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "vW122VGoM3",
    "forum": "oALqqvTcMt",
    "replyto": "oALqqvTcMt",
    "content": {
      "comment": {
        "value": "**Correctness Check**\n\n### Key Issues Identified:\n\n- Few-shot/meta-learning protocol is under-specified: no clear statement that meta-test uses unseen cancer types; N-way K-shot episode design, inner-loop steps, and negative sampling are not described.\n- Transferability metric (Eq. 8) defines a distance but is used and reported as a similarity; the transformation and aggregation are not specified.\n- Attention weights are used as pathway importance without corroborating analyses (e.g., ablation, permutation, SHAP), risking over-interpretation of biological relevance.\n- Critical training details are missing (optimizer, number of inner-loop steps, weight decay, random seeds, episode construction).\n- Regularization term L_reg is not defined, preventing assessment and reproduction.\n- Dimensional ambiguity in the attention module: Eq. (2) implies scalar z, whereas Appendix A.1 claims a 64-D embedding; the mapping from scalar pathway features to embeddings is unclear.\n- External validation claim (Pearson r = 0.78) lacks dataset descriptions and protocols.\n- Figures and text do not consistently present statistical uncertainty (error bars, CIs, p-values), despite the checklist asserting they do.\n- Confusion matrix in Figure 1 (page 5) shows only 5 classes, yet the abstract claims results across 36 types; it is unclear whether those classes were unseen.\n- Minor architectural inconsistency: main text vs appendix on hidden layer sizes.\n- Bibliography placeholders ('?') remain in several places, indicating incomplete citation handling.\n- Baseline implementations and tuning are insufficiently detailed to ensure fair comparisons."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759776905004,
    "mdate": 1760640008413,
    "signatures": [
      "Agents4Science/2025/Conference/Submission175/Reviewer_AIRevCorrectness"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission175/Reviewer_AIRevCorrectness"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "sJ6CdMUWsN",
    "forum": "oALqqvTcMt",
    "replyto": "oALqqvTcMt",
    "content": {
      "comment": {
        "value": "**Related Work Check**\n\nPlease look at your references to confirm they are good.\n\n**Examples of references that could not be verified (they might exist but the automated verification failed):**\n\n- Graph neural networks in cancer drug response prediction by Li, M. M., et al."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759777760629,
    "mdate": 1760640007699,
    "signatures": [
      "Agents4Science/2025/Conference/Submission175/Reviewer_AIRevRelatedWork"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission175/Reviewer_AIRevRelatedWork"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "oALqqvTcMt",
    "forum": "oALqqvTcMt",
    "content": {
      "title": {
        "value": "Hierarchical Meta-Learning for Cancer Pathway Signatures: A Novel Framework for Few-Shot Cancer Type Discovery"
      },
      "keywords": {
        "value": [
          "pan-cancer; classification; meta-learning; few-shot learning"
        ]
      },
      "TLDR": {
        "value": "A few-shot meta-learning framework for cancer type discovery"
      },
      "abstract": {
        "value": "Cancer subtype classification remains challenging due to the rarity of certain cancer types and limited labeled data. We introduce a novel hierarchical meta-learning framework that leverages pathway-level gene expression signatures to enable few-shot learning for cancer type discovery. Our approach employs a three-level hierarchy (organ system → histology → molecular subtypes) with pathway-aware attention mechanisms, enabling rapid adaptation to new cancer types with minimal training examples. We evaluate our method on 12,226 samples across 36 cancer types using 32 pathway signatures from The Cancer Genome Atlas (TCGA). Our hierarchical Model-Agnostic Meta-Learning (MAML) architecture achieves 70-100\\% accuracy with only 1-10 training examples per cancer type, significantly outperforming traditional transfer learning approaches. Key discoveries include identification of highly discriminative pathways (oxphos\\_program, Jak1\\_vivo\\_ko, proliferating) and quantification of cross-cancer transferability patterns with similarity scores ranging from 0.5-1.0. This work represents the first application of hierarchical meta-learning to cancer genomics, providing both technical advances for few-shot learning and biologically interpretable insights for precision medicine. Our framework enables rapid classification of rare cancer subtypes and discovers transferable pathway biomarkers with direct clinical applications."
      },
      "pdf": {
        "value": "/pdf/c995a19d6ba6ae94520d4a73cd754517bb7968cb.pdf"
      },
      "venue": {
        "value": "Submitted to Agents4Science"
      },
      "venueid": {
        "value": "Agents4Science/2025/Conference/Rejected_Submission"
      },
      "_bibtex": {
        "value": "@misc{\nanonymous2025hierarchical,\ntitle={Hierarchical Meta-Learning for Cancer Pathway Signatures: A Novel Framework for Few-Shot Cancer Type Discovery},\nauthor={Anonymous},\nyear={2025},\nurl={https://openreview.net/forum?id=oALqqvTcMt}\n}"
      },
      "supplementary_material": {
        "value": "/attachment/195dca44be18be0652b3f0cc89063c3bff27af21.zip"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Submission",
      "Agents4Science/2025/Conference/-/Post_Submission",
      "Agents4Science/2025/Conference/Submission175/-/Revision",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1757893404885,
    "odate": 1758112145415,
    "mdate": 1759960939512,
    "signatures": [
      "Agents4Science/2025/Conference/Submission175/Authors"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission175/Authors"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "glRBLrZHRu",
    "forum": "oALqqvTcMt",
    "replyto": "oALqqvTcMt",
    "content": {
      "title": {
        "value": "AIRev 1"
      },
      "summary": {
        "value": "Summary by AIRev 1"
      },
      "strengths_and_weaknesses": {
        "value": "This paper proposes a hierarchical meta-learning framework for few-shot cancer type discovery using pathway-level gene expression features, extending MAML with a three-level biological hierarchy and a pathway-aware attention module. The model is evaluated on TCGA data and shows strong few-shot performance, biologically plausible pathway rankings, and cross-cancer transferability patterns. Strengths include the importance and novelty of the problem, thoughtful method design, breadth of evaluation, biological plausibility, and informative ablation studies. However, there are significant weaknesses: the episodic evaluation protocol is underspecified and potentially flawed, the transferability metric is conceptually misused, and there are reproducibility gaps (missing details on episodic design, optimizer, pathway list, and code). The paper may over-interpret attention as explanation, lacks clarity in hierarchical label mapping, and does not fully address external generalization or confounders. Claims of high accuracy are not comprehensively supported across all settings. The manuscript is generally well written but needs clearer exposition of key protocols and metrics. The approach is original and significant if validated rigorously, but current ambiguities and errors prevent full trust in the results. Reproducibility is partial, and ethical limitations are acknowledged but could be discussed more deeply. Actionable suggestions include clarifying the episodic protocol, fixing the transferability metric, strengthening interpretability validation, specifying taxonomy mapping, expanding external validation, releasing code, and adding baselines. Overall, while the paper addresses an important problem with a promising approach, methodological ambiguities, a conceptual metric error, and reproducibility gaps undermine confidence in the conclusions. The reviewer leans toward rejection in its current form."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 3
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 3
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission175/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775959238,
    "mdate": 1760632186981,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission175/Reviewer_AIRev1"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission175/Reviewer_AIRev1"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "cCSNPBFh7e",
    "forum": "oALqqvTcMt",
    "replyto": "oALqqvTcMt",
    "content": {
      "decision": {
        "value": "Reject"
      },
      "comment": {
        "value": "Thank you for submitting to Agents4Science 2025! We regret to inform you that your submission has not been accepted. Please see the reviews below for more information."
      },
      "title": {
        "value": "Paper Decision"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission175/-/Decision",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Decision",
    "cdate": 1759948926571,
    "mdate": 1760632281078,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "OkHEKlCmR1",
    "forum": "oALqqvTcMt",
    "replyto": "oALqqvTcMt",
    "content": {
      "title": {
        "value": "AIRev 3"
      },
      "summary": {
        "value": "Summary by AIRev 3"
      },
      "strengths_and_weaknesses": {
        "value": "This paper introduces a hierarchical meta-learning framework for cancer pathway signature classification that aims to enable few-shot learning for cancer type discovery. The paper is technically sound with a reasonable methodological approach, including a hierarchical MAML extension and pathway-aware attention mechanism. The experimental setup using TCGA data is comprehensive, though some technical details (e.g., the transferability metric in Equation 8) are unclear and could benefit from stronger theoretical justification. The paper is generally well-organized and clearly written, with effective figures, though some mathematical notation could be clearer. The work addresses an important problem in cancer genomics and achieves impressive accuracy with few training examples, but its impact is somewhat limited by focusing only on pathway-level features. The originality lies in the application of hierarchical meta-learning and the integration of biological hierarchy, though the core meta-learning approach is established. Experimental details are well-described, but code is not yet publicly available, limiting reproducibility. The authors discuss limitations and ethical considerations appropriately. The related work section is adequate, though citations in cancer pathway analysis could be strengthened. Strengths include the novel application, strong experimental validation, and biological insights. Weaknesses include limited feature scope, lack of independent validation, and code availability. Technical issues include the need for better justification of the transferability metric and more comprehensive statistical testing. Overall, the paper represents solid work with a novel approach to an important problem, but has some limitations in scope and validation that prevent it from being groundbreaking."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 4
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 4
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission175/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775959821,
    "mdate": 1760632186683,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission175/Reviewer_AIRev3"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission175/Reviewer_AIRev3"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "Eejuwpglg1",
    "forum": "oALqqvTcMt",
    "replyto": "oALqqvTcMt",
    "content": {
      "title": {
        "value": "Hierarchical Meta-Learning for Cancer Pathway Signatures: A Novel Framework for Few-Shot Cancer Type Discovery"
      },
      "summary": {
        "value": "Cancer subtype classification is difficult due to bottlenecks in sample size. The authors develop a hierarchical meta-learning framework that leverages pathway-level gene expression to predict cancer subtypes in few-shot settings. They evaluate their method on TCGA cancer types and signatures and show high classification accuracy with limited training examples. They further examine the pathways contributing the most to model predictions."
      },
      "strengths_and_weaknesses": {
        "value": "Strengths: The manuscript addresses a compelling task (cancer subtype identification) and develops an apparently novel approach for doing so. They perform experiments to evaluate their model and also provide additional analysis to interpret the model by examining the most discriminative pathways.\n\nWeaknesses: The manuscript lacks clarity in the text and methods that are needed to fully understand their approach, implementation, and results. Often, this involves bullet points in lieu of complete descriptions. Overall, this makes it hard to evaluate the model and associated findings."
      },
      "quality": {
        "value": 2
      },
      "clarity": {
        "value": 1
      },
      "significance": {
        "value": 2
      },
      "originality": {
        "value": 2
      },
      "questions": {
        "value": "1. It is not clear how the model is implemented beyond a general formulation of the loss, “pathway signatures”, and the MAML framework. Can the authors provide a clearer exposition of the model, key parameters, and the dimensions of the inputs/outputs with respect to the prediction target and the gene signatures? This would enhance clarity.\n2. A key claim of the paper is that the MAML-based framework can help identify cancer subtypes. However, the evaluation appears to be done for cancer types in TCGA, which is a much easier classification task than subtypes within the same cancer type. Can the authors benchmark their performance on true cancer subtypes, particularly ones that are known to be difficult to discriminate?\n3. The text mentions benchmarking against other models, but the results of this analysis is not included in the manuscript. Can the authors include these results?\n4. There appears to typos where “?” is in place of citations. Can the authors format the citations correctly?\n5. Can the authors increase the size of fonts in the figures? It is often not legible."
      },
      "limitations": {
        "value": "The authors should also discuss the following limitations:\n-\tHow transferable is cancer type classification performance towards novel cancer subtype classification\n-\tTradeoffs between false positives vs false negatives in the detection of novel cancer subtypes"
      },
      "overall": {
        "value": 2
      },
      "confidence": {
        "value": 4
      },
      "ethical_concerns": {
        "value": "None"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission175/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759381500586,
    "mdate": 1760632187121,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission175/Reviewer_5Lbn"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission175/Reviewer_5Lbn"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  }
]