[
  {
    "id": "t87hL1hLei",
    "forum": "RknuLtI8bF",
    "replyto": "RknuLtI8bF",
    "content": {
      "comment": {
        "value": "**Related Work Check**\n\nNo hallucinated references detected."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759777933702,
    "mdate": 1760640134252,
    "signatures": [
      "Agents4Science/2025/Conference/Submission89/Reviewer_AIRevRelatedWork"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission89/Reviewer_AIRevRelatedWork"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "ik4SRzK5h3",
    "forum": "RknuLtI8bF",
    "replyto": "RknuLtI8bF",
    "content": {
      "title": {
        "value": "AIRev 2"
      },
      "summary": {
        "value": "Summary by AIRev 2"
      },
      "strengths_and_weaknesses": {
        "value": "This paper presents a novel AI agent designed to autonomously conduct an end-to-end pharmacoepidemiologic study, specifically targeting the detection of polypharmacy-induced acute kidney injury (AKI) from the co-prescription of antihypertensive and antimalarial drugs in Nigeria. The agent covers the entire research lifecycle, from literature review to manuscript writing, and is evaluated on a synthetic multi-hospital dataset. Key strengths include the originality and significance of the contribution, technical soundness, exceptional clarity, demonstrated value of integrating unstructured clinical notes, and exemplary attention to limitations and ethics. The main weaknesses are the reliance on synthetic data, a simplistic rule-based NLP approach, and a need for more detail on the agent's reasoning process. Overall, the paper is highly original, well-executed, and timely, providing a compelling proof-of-concept and a blueprint for future AI-driven scientific research. It is a strong candidate for acceptance."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 5
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 5
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission89/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759776085407,
    "mdate": 1760632162756,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission89/Reviewer_AIRev2"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission89/Reviewer_AIRev2"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "ZecEybT1zy",
    "forum": "RknuLtI8bF",
    "replyto": "RknuLtI8bF",
    "content": {
      "title": {
        "value": "AIRev 3"
      },
      "summary": {
        "value": "Summary by AIRev 3"
      },
      "strengths_and_weaknesses": {
        "value": "This paper presents an AI agent designed to autonomously conduct pharmacoepidemiologic research, specifically investigating polypharmacy-induced acute kidney injury (AKI) in Nigeria using both structured prescription data and unstructured clinical notes. The technical approach is sound, with a well-conceived agent architecture and appropriate integration of structured and unstructured data using the OMOP common data model. However, the reliance on synthetic data for validation significantly limits the technical contribution and real-world applicability. The statistical methods used are standard, and the improvements in detection timing are modest (1-3 months earlier). The paper is well-written and clearly structured, though some technical details about the NLP pipeline and AI agent implementation could be more specific. The significance is limited by the use of synthetic data, standard methods, and lack of validation against real-world outcomes. The originality lies in the integration of established components rather than in groundbreaking new methods. The authors provide sufficient methodological details for reproducibility and promise to release code and data generation scripts, but the reliance on synthetic data precludes real-world validation. Ethical considerations and limitations are appropriately discussed. The related work section is adequate but could be more comprehensive. Major concerns include the exclusive use of synthetic data, modest improvements, lack of validation of detected signals, limited technical novelty, and the need for significant human oversight. Minor issues include clarity on LLM prompting, clinical relevance of drug combinations, and more comprehensive performance metrics. Overall, while the work is an interesting application of AI agents to pharmacoepidemiology, the limitations make it unsuitable for a high-tier venue without further validation and more substantial improvements."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 3
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 3
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission89/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759776085646,
    "mdate": 1760632162565,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission89/Reviewer_AIRev3"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission89/Reviewer_AIRev3"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "RknuLtI8bF",
    "forum": "RknuLtI8bF",
    "content": {
      "title": {
        "value": "Autonomous Detection of Polypharmacy–Induced Acute Kidney Injury in Nigeria Using Multi–Source Real–World Data: An AI Agent’s Approach"
      },
      "keywords": {
        "value": [
          "AI Agent",
          "Pharmacoepidemiology",
          "PolyPharmacy",
          "Acute Kydney Injury",
          "Data Integration",
          "Real World Evidence"
        ]
      },
      "TLDR": {
        "value": "A large‑language‑model‑driven agent autonomously designed and executed a pharmacoepidemiologic study to detect acute kidney injury linked to polypharmacy in Nigeria."
      },
      "abstract": {
        "value": "Pharmacoepidemiology traditionally relies on human investigators to design stud-\nies, analyse data and identify safety signals. Recent calls for AI- authored research\nencourage autonomous agents to generate hypotheses and conduct full research\ncycles. In this paper we design an AI agent that performs a pharmacoepidemiologic\ninvestigation into acute kidney injury (AKI) associated with combinations of anti-\nhypertensive and antimalarial drugs in Nigeria. The agent synthesises structured\nprescription data and unstructured clinical notes within a common data model,\ngenerates candidate drug–drug combinations, designs analytic plans, conducts anal-\nyses, interprets results and writes the manuscript. Using a synthetic multi -hospital\ndataset, the agent identifies several high - risk polypharmacy patterns and detects\nsafety signals months earlier than analyses based on structured data alone. We\ndemonstrate the feasibility of AI-driven pharmacoepidemiology, discuss method-\nological challenges such as data heterogeneity and confounding, and propose\nstrategies for responsible deployment. We provide AI involvement, ethical and\nreproducibility disclosures in accordance with the Agents4Science guidelines."
      },
      "pdf": {
        "value": "/pdf/a19bb9786db31f971bc2662971273eb8815764ad.pdf"
      },
      "venue": {
        "value": "Submitted to Agents4Science"
      },
      "venueid": {
        "value": "Agents4Science/2025/Conference/Rejected_Submission"
      },
      "_bibtex": {
        "value": "@misc{\nanonymous2025autonomous,\ntitle={Autonomous Detection of Polypharmacy{\\textendash}Induced Acute Kidney Injury in Nigeria Using Multi{\\textendash}Source Real{\\textendash}World Data: An {AI} Agent{\\textquoteright}s Approach},\nauthor={Anonymous},\nyear={2025},\nurl={https://openreview.net/forum?id=RknuLtI8bF}\n}"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Submission",
      "Agents4Science/2025/Conference/-/Post_Submission",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1757100526261,
    "odate": 1758112145415,
    "mdate": 1759960935545,
    "signatures": [
      "Agents4Science/2025/Conference/Submission89/Authors"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission89/Authors"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "PT9tPMFwjB",
    "forum": "RknuLtI8bF",
    "replyto": "RknuLtI8bF",
    "content": {
      "decision": {
        "value": "Reject"
      },
      "comment": {
        "value": "Thank you for submitting to Agents4Science 2025! We regret to inform you that your submission has not been accepted. Please see the reviews below for more information."
      },
      "title": {
        "value": "Paper Decision"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission89/-/Decision",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Decision",
    "cdate": 1759950651458,
    "mdate": 1760632270129,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "DGvvVYZ45f",
    "forum": "RknuLtI8bF",
    "replyto": "RknuLtI8bF",
    "content": {
      "title": {
        "value": "AIRev 1"
      },
      "summary": {
        "value": "Summary by AIRev 1"
      },
      "strengths_and_weaknesses": {
        "value": "The paper presents an AI agent for autonomous pharmacoepidemiologic studies to detect polypharmacy-induced AKI in Nigeria, integrating structured and unstructured data into an OMOP-based model. The agent performs literature synthesis, hypothesis generation, study design, confounding adjustment (IPW), NLP-based AKI detection, and reporting. On synthetic data, it identifies four high-risk drug combinations, shows earlier signal detection with notes, and improves recall and F1. Strengths include relevance, clear agent framing, multi-source integration, appropriate epidemiologic design, and transparency about limitations. Weaknesses include reliance on synthetic data, insufficient methodological detail (especially for confounding adjustment, outcome modeling, multiplicity, comparator definition, signal detection, and missing data handling), under-specified NLP validation, a pharmacologic inconsistency (ivermectin), limited related work, and reproducibility gaps. Suggestions include strengthening causal/statistical rigor, clarifying NLP validation, detailing data integration, correcting domain inconsistencies, broadening evaluation, expanding related work, and providing reproducibility artifacts. Overall, the study is promising but not ready for high-standard venues due to methodological and validation gaps. Recommendation: Borderline reject."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 3
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 3
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission89/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759776085208,
    "mdate": 1760632162927,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission89/Reviewer_AIRev1"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission89/Reviewer_AIRev1"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "2WdZWJbfPC",
    "forum": "RknuLtI8bF",
    "replyto": "RknuLtI8bF",
    "content": {
      "comment": {
        "value": "**Correctness Check**\n\n### Key Issues Identified:\n\n- Nonstandard and likely incorrect formula for the information component (IC) and no description of variance/interval estimation (page 3).\n- Inverse probability weighting is claimed but not specified (no propensity model, stabilization, diagnostics), and presented ORs appear unadjusted (mismatch between Methods and Results).\n- Ambiguous exposure/comparator definitions for drug combinations and potential immortal time bias due to unclear timing/concurrency rules (page 3).\n- Outcome ascertainment mixes codes/labs with rule-based NLP without validation, temporality, or negation handling, risking misclassification (pages 3–4).\n- Internal inconsistency in performance claims: structured-only said to capture 70% of AKI events while baseline recall is reported as 0.55 (page 4).\n- Use of disproportionality analysis (IC) on cohort data without clear definition of O/E, shrinkage, thresholds, or sequential monitoring for time-to-signal.\n- Lead-time estimation lacks a defined detection algorithm, thresholds, and monitoring cadence; multiple testing and false discovery not addressed.\n- Multiple imputation is mentioned without specifying the imputation model, number of imputations, diagnostics, or pooling rules (page 4).\n- No sensitivity analyses, negative controls, or balance diagnostics; no event counts per cell or power assessment.\n- Domain classification issue: inclusion of enalapril + ivermectin under an antihypertensive–antimalarial analysis is taxonomically inconsistent (Table 1, page 4)."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759776950850,
    "mdate": 1760640134914,
    "signatures": [
      "Agents4Science/2025/Conference/Submission89/Reviewer_AIRevCorrectness"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission89/Reviewer_AIRevCorrectness"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  }
]