[
  {
    "id": "u8XEJL08wU",
    "forum": "S8uzdZvStA",
    "replyto": "S8uzdZvStA",
    "content": {
      "title": {
        "value": "AIRev 2"
      },
      "summary": {
        "value": "Summary by AIRev 2"
      },
      "strengths_and_weaknesses": {
        "value": "This paper introduces a novel hybrid intrusion detection system (IDS) framework, GATv2-NS3, which couples a Graph Attention Network v2 (GATv2) with the NS-3 network simulator. The key innovation is the 'Self-Focusing Simulations' mechanism, where uncertainty in the GNN's predictions, measured by attention entropy, dynamically triggers high-fidelity simulations for ambiguous network regions. The work addresses the issue of performance inflation in IDS research due to static, leakage-prone datasets. The authors conduct rigorous evaluations on both the NSL-KDD and a more realistic Cisco dataset, showing that their protocol yields lower but more realistic performance metrics than commonly reported. While GATv2-NS3 is not the top performer in detection accuracy, the framework reduces computational overhead by 40% and makes a crucial methodological contribution toward more reliable IDS evaluation.\n\nThe paper is technically sound, with a well-motivated framework that combines existing tools in a novel way. The use of attention entropy as a proxy for model uncertainty is clever and effective. The experimental design is a major strength, being rigorous, comprehensive, and detailed, with careful handling to prevent data leakage and robust statistical analysis. The main weakness is the detection performance of GATv2-NS3, which is outperformed by other models on both datasets. However, this reinforces the paper's primary contribution: proposing a new evaluation paradigm rather than a new state-of-the-art classifier. The finding that GNNs struggle on realistic, sparse topologies is itself valuable.\n\nThe paper is exceptionally clear, well-written, and well-organized, with exemplary detail for reproducibility. Its significance is substantial, primarily methodological, as it addresses the reproducibility crisis in IDS research and provides a template for more realistic and trustworthy evaluation. The originality is high, with a novel integration of uncertainty quantification and network simulation. Reproducibility is a standout strength, with exhaustive experimental details provided. The authors are forthright about limitations and there are no ethical concerns; the work promotes more honest and realistic performance reporting.\n\nOverall, this is an outstanding paper that makes a significant and timely contribution to network security research. Its rigorous and novel methodological framework challenges the status quo and provides a path toward more reliable research. Despite not achieving state-of-the-art accuracy, the insights and benchmarks provided are of great importance. This paper is exemplary and a clear candidate for acceptance."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 6
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 6
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission308/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775696470,
    "mdate": 1760632228176,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission308/Reviewer_AIRev2"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission308/Reviewer_AIRev2"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "bXf8dUdYRv",
    "forum": "S8uzdZvStA",
    "replyto": "S8uzdZvStA",
    "content": {
      "title": {
        "value": "AIRev 3"
      },
      "summary": {
        "value": "Summary by AIRev 3"
      },
      "strengths_and_weaknesses": {
        "value": "This paper presents GATv2-NS3 Hybrid IDS, combining Graph Attention Networks v2 with adaptive NS-3 simulation for network intrusion detection. The key innovation is 'Self-Focusing Simulations' using attention entropy to dynamically allocate simulation resources. The approach is technically sound, novel, and well-motivated, with a rigorous experimental methodology and clear, reproducible reporting. The paper addresses a significant gap between academic IDS claims and real-world performance, providing valuable insights into generalization challenges and demonstrating computational efficiency gains. However, the core GATv2 model underperforms (F1=0.486 on Cisco dataset), which undermines the contribution, and the self-focusing mechanism's effectiveness is shown mainly in computational savings rather than detection improvements. Evaluation is limited to two datasets, and practical impact is reduced by the poor base model performance. Strengths include methodological rigor, honest reporting, and transparent discussion of limitations. Overall, the paper makes solid methodological contributions and introduces an innovative uncertainty-driven simulation approach, despite concerns about base model performance."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 4
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 4
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission308/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775696721,
    "mdate": 1760632227843,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission308/Reviewer_AIRev3"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission308/Reviewer_AIRev3"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "a0ggzAHFyG",
    "forum": "S8uzdZvStA",
    "replyto": "S8uzdZvStA",
    "content": {
      "title": {
        "value": "An interesting approach for network intrusion detection proposed but lacking sufficient empirical support"
      },
      "summary": {
        "value": "This papers proposes a graph attention-based mechanism for efficient simulation of network attacks that reveal lower performance of existing network intrusion detection methods. It utilizes attention entropy as a measure of network uncertainty to guide the injection of effective intrusion, and tests a diverse set of algorithms for detecting the intrusion, benchmarking their varied performance."
      },
      "strengths_and_weaknesses": {
        "value": "Strengths:  The problem is important and the proposed intrusion simulation method is reasonably designed.  \n\nWeaknesses:  \n1. The paper, while claiming the proposed intrusion simulation method reveals lower performance compared to the literature, does not provide direct empirical evidence of the claim. The experiments are done on newly simulated datasets, where the performance of existing intrusion simulations is not available for direct comparison.  \n2.  The paper compared several intrusion detection methods, which are based on rather standard models not specifically designed for intrusion detection, and the results do not directly explain why the proposed intrusion simulation mechanism is effective.  \n3. Some technical and experimental details are missing. For example, Section 3.4 discussed how attacks are generated for the Cisco dataset, without mentioning the NSL-KDD dataset.\n4. The organization of the paper is not ideal. For example, subsections about the experimental settings are scattered into the Methodology section, and discussions about experimental results are scattered into the Conclusion section."
      },
      "quality": {
        "value": 2
      },
      "clarity": {
        "value": 2
      },
      "significance": {
        "value": 2
      },
      "originality": {
        "value": 2
      },
      "questions": {
        "value": "See weaknesses."
      },
      "limitations": {
        "value": "See weaknesses."
      },
      "overall": {
        "value": 2
      },
      "confidence": {
        "value": 4
      },
      "ethical_concerns": {
        "value": "None noted."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission308/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759688495971,
    "mdate": 1760632228614,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission308/Reviewer_wtav"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission308/Reviewer_wtav"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "S8uzdZvStA",
    "forum": "S8uzdZvStA",
    "content": {
      "title": {
        "value": "GATv2-NS3 Hybrid IDS: Self-Focusing Simulations for Network Intrusion Detection"
      },
      "keywords": {
        "value": [
          "Intrusion Detection Systems",
          "Graph Attention Networks",
          "Uncertainty-driven simulation control"
        ]
      },
      "TLDR": {
        "value": "This work introduces a hybrid IDS framework combining GATv2 with uncertainty-driven simulation triggers in NS-3, delivering realistic, leakage-aware evaluation and improved efficiency under constrained compute."
      },
      "abstract": {
        "value": "Network intrusion detection faces critical challenges from data leakage and artificial performance inflation in static evaluation protocols. We introduce GATv2-NS3 Hybrid IDS, combining Graph Attention Networks v2 with adaptive NS-3 simulation. Our key innovation, Self-Focusing Simulations, uses attention uncertainty to dynamically allocate simulation resources to ambiguous network regions. The system triggers focused NS-3 simulations when attention entropy exceeds adaptive thresholds, creating efficient feedback loops. Evaluation on NSL-KDD and Cisco datasets reveals realistic IDS performance is significantly lower than commonly reported—our method achieves F1=0.711 while traditional approaches reach F1$\\approx$0.75 on NSL-KDD. The self-focusing mechanism reduces computational overhead by 40\\% compared to uniform simulation while maintaining detection quality. Our findings demonstrate that rigorous evaluation yields substantially lower but more honest performance metrics, highlighting the gap between academic claims and practical deployment realities."
      },
      "pdf": {
        "value": "/pdf/4585f678e2431dd9bf68f382b8e6f6d1ea5556fa.pdf"
      },
      "supplementary_material": {
        "value": "/attachment/77835e196c4e88a8dc33371fc23924590c6b17d2.zip"
      },
      "venue": {
        "value": "Agents4Science 2025 Conference Withdrawn Submission"
      },
      "venueid": {
        "value": "Agents4Science/2025/Conference/Withdrawn_Submission"
      },
      "_bibtex": {
        "value": "@misc{\nalexander2025gatvns,\ntitle={{GAT}v2-{NS}3 Hybrid {IDS}: Self-Focusing Simulations for Network Intrusion Detection},\nauthor={Buyantuev Alexander and Aliaksei Korshuk and Aleksei Stepin and Ilya Gusev and Vladimir Kubasov and Vladislav Kulikov and Artyom Kabanov and Mikhail Mozikov and Ilya Makarov},\nyear={2025},\nurl={https://openreview.net/forum?id=S8uzdZvStA}\n}"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Submission",
      "Agents4Science/2025/Conference/-/Post_Submission",
      "Agents4Science/2025/Conference/Submission308/-/Revision",
      "Agents4Science/2025/Conference/-/Edit",
      "Agents4Science/2025/Conference/-/Withdrawn_Submission"
    ],
    "cdate": 1758023925301,
    "odate": 1758112145415,
    "mdate": 1765061680089,
    "signatures": [
      "Agents4Science/2025/Conference/Submission308/Authors"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission308/Authors"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "CJsFBz55p3",
    "forum": "S8uzdZvStA",
    "replyto": "S8uzdZvStA",
    "content": {
      "comment": {
        "value": "**Correctness Check**\n\n### Key Issues Identified:\n\n- Ambiguity about whether reported results correspond to the proposed hybrid (GATv2-NS3) or a plain GATv2 baseline. Table 1 (page 5) lists 'GATv2', while the text (Section 5.1) attributes results to 'GATv2-NS3'.\n- Metric reporting inconsistency in Table 1 (page 5): for NSL-KDD rows, Accuracy equals Recall across multiple models, suggesting a computation or labeling error (macro recall should not identically equal accuracy).\n- NSL-KDD class counts do not sum to the stated total (148,517 vs. listed per-class sum of 138,105).\n- Under-specification of the hybrid integration: definitions of f_real and f_sim in Lsim, the exact form of Latt, how ns-3 simulation features are generated and fused, and how backpropagation incorporates simulation outputs.\n- Potential data leakage in NSL-KDD due to k-NN graph construction and normalization if performed over the entire dataset before cross-validation; per-fold fitting and graph construction are not specified.\n- Lack of essential ablations: no explicit comparison of self-focusing vs. uniform simulation vs. no simulation under matched budgets to support the '40% computational reduction while maintaining detection quality' claim.\n- Cisco dataset splitting/protocol details are insufficient: it is unclear how time-based splits are implemented across flows/graphs and how leakage across time windows is prevented.\n- Several truncated or malformed quantitative statements in the text (e.g., 'F10.75 vs. 90') that obscure meaning and reduce formal clarity.\n- Extremely poor GraphSAGE performance on Cisco (F1=0.058±0.031) and unusual precision/recall profiles (e.g., GATv2 on Cisco with precision 0.333 and recall 0.900) without diagnostic analysis, raising concerns about configuration or thresholding choices.\n- Claims of strong correlation (r=0.78) between attention entropy and accuracy improvement lack methodological details (type of correlation, unit of analysis, sample size, confidence intervals)."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759776809623,
    "mdate": 1760640132220,
    "signatures": [
      "Agents4Science/2025/Conference/Submission308/Reviewer_AIRevCorrectness"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission308/Reviewer_AIRevCorrectness"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "Bbrnwho3Cv",
    "forum": "S8uzdZvStA",
    "replyto": "S8uzdZvStA",
    "content": {
      "comment": {
        "value": "**Related Work Check**\n\nPlease look at your references to confirm they are good.\n\n**Examples of references that could not be verified (they might exist but the automated verification failed):**\n\n- A survey of deep learning for network intrusion detection by Joffrey L Leevy, Taghi M Khoshgoftaar\n- Ssf: Accelerating continual learning for network intrusion detection with self-supervised features by Ying Zhang, Bing Li, et al.\n- Cisco secure workload networks of computing hosts by Stanford Network Analysis Project"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759777847790,
    "mdate": 1760640131447,
    "signatures": [
      "Agents4Science/2025/Conference/Submission308/Reviewer_AIRevRelatedWork"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission308/Reviewer_AIRevRelatedWork"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "Bb7uyNezR7",
    "forum": "S8uzdZvStA",
    "replyto": "S8uzdZvStA",
    "content": {
      "title": {
        "value": "AIRev 1"
      },
      "summary": {
        "value": "Summary by AIRev 1"
      },
      "strengths_and_weaknesses": {
        "value": "This paper introduces GATv2-NS3 Hybrid IDS, a closed-loop intrusion detection framework that leverages GATv2 attention entropy as an uncertainty signal to adaptively trigger high-fidelity ns-3 simulations on ambiguous subgraphs. The aim is to allocate simulation resources where the model is uncertain, reduce compute, and obtain more realistic, leakage-free performance estimates. Experiments on NSL-KDD and a Cisco enterprise-like dataset (with synthetic attacks) report lower, more realistic IDS performance (F1 ≈ 0.71–0.75 on NSL-KDD), traditional ML outperforming GNNs on the Cisco dataset, and a claimed 40% reduction in simulation compute via self-focusing.\n\nStrengths include a compelling problem framing, honest evaluation stance, clear writing, methodological clarity, and broad baseline coverage. However, there are significant concerns:\n\n1. Incomplete evidence for the core contribution: The claimed compute savings and maintenance of detection quality are not substantiated with direct ablation tables or runtime breakdowns, making the results assertions rather than reproducible findings.\n2. Ambiguity in the hybrid loop and feature alignment: Key components such as f_real and f_sim are not precisely defined, and the workflow lacks algorithmic pseudocode or a detailed diagram, impeding reproducibility.\n3. Mismatch between claimed method and reported results: It is unclear whether reported results correspond to the full hybrid system or a plain GATv2, affecting interpretation.\n4. Limited empirical support for improved cost-adjusted utility: The method underperforms strong baselines (e.g., RandomForest) on the Cisco dataset, and cost-adjusted comparisons are missing.\n5. Statistical analysis is asserted but not shown: No test statistics or effect sizes are provided.\n6. Dataset construction choices limit external validity: Use of artificial graphs and synthetic attacks weakens generalizability.\n7. Reproducibility of simulation coupling is unclear: Critical integration details are missing.\n\nThe paper is generally well written and original in its use of attention entropy for adaptive simulation fidelity, and the meta-result about realistic, leakage-aware protocols is significant. Limitations are candidly discussed, and related work is broadly covered. However, the lack of algorithmic detail, empirical substantiation, and compute-normalized comparisons, as well as underperformance on realistic datasets, undermine the case for acceptance. The reviewer recommends rejection, with the hope that a future version addresses these issues with stronger ablations, clearer pipeline exposition, and more rigorous comparisons."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 3
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 3
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission308/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775696238,
    "mdate": 1760632228428,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission308/Reviewer_AIRev1"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission308/Reviewer_AIRev1"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "09jbZbOAcW",
    "forum": "S8uzdZvStA",
    "replyto": "S8uzdZvStA",
    "content": {
      "decision": {
        "value": "Reject"
      },
      "comment": {
        "value": "Thank you for submitting to Agents4Science 2025! We regret to inform you that your submission has not been accepted. Please see the reviews below for more information."
      },
      "title": {
        "value": "Paper Decision"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission308/-/Decision",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Decision",
    "cdate": 1759948919396,
    "mdate": 1760632301318,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  }
]