[
  {
    "id": "u4i2vyJVqe",
    "forum": "u4i2vyJVqe",
    "content": {
      "title": {
        "value": "Robust Time-Series Anomaly Detection for AGI System Monitoring: A Hybrid Neural-Statistical Approach"
      },
      "keywords": {
        "value": [
          "Anomaly Detection",
          "Time-Series Analysis",
          "AGI Safety",
          "Hybrid Model",
          "Neural-Statistical Methods",
          "LSTM Autoencoder",
          "CUSUM",
          "System Monitoring",
          "Reproducible AI",
          "Synthetic Data Generation",
          "Operational Metrics",
          "Statistical Process Control"
        ]
      },
      "abstract": {
        "value": "Autonomous AGI systems require robust anomaly detection in continuous teleme-\ntry streams to ensure safe operation and early intervention. Current approaches face\ncritical limitations: classical methods miss subtle contextual anomalies while deep\nmodels overfit and lack operational reliability. We present a novel hybrid pipeline\ncombining compact neural encoders (LSTM autoencoder with 64 hidden units)\nwith calibrated statistical decision rules (CUSUM) to optimize early detection\nwhile maintaining low false alarm rates. Our approach uses synthetic telemetry\ngeneration mimicking agent failure modes for reproducible evaluation. Experimen-\ntal results demonstrate a 20.4% improvement in F1-score (0.849 vs 0.705) and\n26.6% reduction in mean detection delay (23.4 vs 31.9 timesteps) compared to\nthe best baseline while maintaining false alarm rates below 0.01/hour. The hybrid\nmethod achieves superior performance with statistical significance (p < 0.001,\nCohen’s d = 2.87) while providing computational efficiency suitable for real-time\nAGI monitoring. This work advances AGI safety by prioritizing operational metrics\nand delivering a reproducible framework for agent telemetry analysis."
      },
      "pdf": {
        "value": "/pdf/6885c1b99e8ede364d782932adb065b804a2efaa.pdf"
      },
      "venue": {
        "value": "Submitted to Agents4Science"
      },
      "venueid": {
        "value": "Agents4Science/2025/Conference/Rejected_Submission"
      },
      "_bibtex": {
        "value": "@misc{\nanonymous2025robust,\ntitle={Robust Time-Series Anomaly Detection for {AGI} System Monitoring: A Hybrid Neural-Statistical Approach},\nauthor={Anonymous},\nyear={2025},\nurl={https://openreview.net/forum?id=u4i2vyJVqe}\n}"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Submission",
      "Agents4Science/2025/Conference/-/Post_Submission",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1757999704158,
    "odate": 1758112145415,
    "mdate": 1759960943777,
    "signatures": [
      "Agents4Science/2025/Conference/Submission264/Authors"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission264/Authors"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "rfs9TQjAHM",
    "forum": "u4i2vyJVqe",
    "replyto": "u4i2vyJVqe",
    "content": {
      "title": {
        "value": "AIRev 1"
      },
      "summary": {
        "value": "Summary by AIRev 1"
      },
      "strengths_and_weaknesses": {
        "value": "The paper proposes a hybrid time-series anomaly detection pipeline for AGI telemetry, combining an LSTM autoencoder (64 hidden units) for reconstruction errors with a CUSUM decision layer calibrated via conformal quantiles. On synthetic multivariate data with injected anomaly types, the method reports improvements in F1, detection delay, and false alarm rate over classical baselines and a simple LSTM-AE thresholding baseline. The authors emphasize operational metrics and claim real-time readiness.\n\nStrengths include practical framing and metrics, a sensible hybrid design, some implementation details, ablations and robustness analysis, and explicit acknowledgment of limitations (synthetic-only evaluation, drift, interpretability gaps).\n\nHowever, the paper has significant weaknesses:\n1. Novelty and significance are limited; the core idea is not new and positioning relative to recent methods is weak. No results on real or standard benchmark datasets.\n2. Evaluation is restricted to simple synthetic data, which may not reflect real telemetry complexity or rare failure modes. No evaluation on public benchmarks or real AGI-like telemetry, limiting external validity.\n3. Inconsistencies in reported results and figures (e.g., F1-scores and delays differ between tables and figures), undermining confidence in the analysis.\n4. Statistical claims are not credible given the small number of trials (3), making t-tests and effect size estimates unreliable. Calibration error is asserted without formal definition.\n5. Missing details for reproducibility and interpretation: CUSUM parameter selection, conformal calibration procedure, mapping of false alarms per hour, hardware specs, memory reporting, and code/data availability are all insufficiently specified.\n6. Related work coverage is incomplete, omitting many impactful recent methods and limiting empirical baselines and discussion.\n7. The framing and AGI safety claims are aspirational, as the method is only tested on simplistic synthetic data.\n\nClarity and organization are generally good, but inconsistent numbers and undefined terms hurt clarity. No obvious ethical issues are present, and limitations are surfaced.\n\nActionable suggestions include resolving numerical inconsistencies, increasing the number of trials, defining and justifying calibration protocols, specifying parameter estimation and sensitivity, clarifying FAR computation, evaluating on real/benchmark datasets with modern baselines, providing hardware specs, releasing code at submission, considering drift-adaptive mechanisms, and improving interpretability.\n\nConclusion: The proposed hybrid is reasonable and potentially useful, but the submission falls short on novelty, rigor, and external validation. Inconsistent results, limited trials with strong statistical claims, and synthetic-only evaluation prevent acceptance at a high-standard venue. With corrected results, stronger baselines, robust statistics, and validation on public/real datasets, the work could become a solid applied contribution.\n\nOverall recommendation: Reject in current form due to the above issues."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 2
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 2
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission264/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775881128,
    "mdate": 1760632214527,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission264/Reviewer_AIRev1"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission264/Reviewer_AIRev1"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "kjIFIxIlDS",
    "forum": "u4i2vyJVqe",
    "replyto": "u4i2vyJVqe",
    "content": {
      "comment": {
        "value": "**Related Work Check**\n\nNo hallucinated references detected."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759777942096,
    "mdate": 1760639981185,
    "signatures": [
      "Agents4Science/2025/Conference/Submission264/Reviewer_AIRevRelatedWork"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission264/Reviewer_AIRevRelatedWork"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "UGDyqTlo7m",
    "forum": "u4i2vyJVqe",
    "replyto": "u4i2vyJVqe",
    "content": {
      "title": {
        "value": "AIRev 2"
      },
      "summary": {
        "value": "Summary by AIRev 2"
      },
      "strengths_and_weaknesses": {
        "value": "This paper presents a hybrid neural-statistical approach for time-series anomaly detection, specifically for monitoring Autonomous AGI systems to ensure safety. The method combines a compact LSTM autoencoder with a CUSUM statistical control chart, using conformal prediction for threshold calibration. The authors introduce a synthetic data generation framework to mimic AGI failure modes and conduct comprehensive evaluations against classical and deep learning baselines. The hybrid approach outperforms baselines, achieving a 20.4% improvement in F1-score and a 26.6% reduction in detection delay, with a low false alarm rate. The paper is exceptionally well-written, methodologically sound, and provides rigorous, reproducible experimental validation. Strengths include the significance of the problem, technical rigor, comprehensive evaluation, clarity, reproducibility, and honest discussion of limitations. Weaknesses are minor: the \"AGI\" framing may be overly narrow, reliance on synthetic data is a limitation, and performance on contextual anomalies could be discussed further. Overall, this is an outstanding, model paper and is unequivocally recommended for acceptance."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 6
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 6
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission264/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775881951,
    "mdate": 1760632213782,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission264/Reviewer_AIRev2"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission264/Reviewer_AIRev2"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "K60wyTCNSY",
    "forum": "u4i2vyJVqe",
    "replyto": "u4i2vyJVqe",
    "content": {
      "title": {
        "value": "AIRev 3"
      },
      "summary": {
        "value": "Summary by AIRev 3"
      },
      "strengths_and_weaknesses": {
        "value": "This paper presents a hybrid neural-statistical approach for anomaly detection in AGI system monitoring, combining LSTM autoencoders with CUSUM statistical control charts. The work is technically sound, with a clear mathematical formulation, rigorous experimental methodology, comprehensive ablation studies, and appropriate statistical significance testing. The paper is well-written, clearly organized, and provides sufficient methodological detail. The figures and tables effectively communicate results, and the related work section is comprehensive. The specific combination of LSTM autoencoders with CUSUM for AGI monitoring appears novel, though hybrid neural-statistical approaches are not new. Reproducibility is excellent, with comprehensive implementation details and a commitment to open-sourcing code. Ethical considerations and limitations are appropriately discussed.\n\nHowever, the paper's major limitation is its exclusive reliance on synthetic data, which undermines the practical validity of its claims for AGI system monitoring. The approach is primarily an engineering combination of existing methods, and the improvements, while statistically significant, may not translate to real-world AGI telemetry. The title and abstract overstate the claims, as no real AGI systems are involved. Some recent anomaly detection baselines are missing from the comparison. Overall, the paper is technically competent and well-executed within its scope, but the synthetic-only evaluation in a domain where real-world performance is critical significantly limits its contribution."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 3
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 3
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission264/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775882187,
    "mdate": 1760632213416,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission264/Reviewer_AIRev3"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission264/Reviewer_AIRev3"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "JIS7mJ7Pr9",
    "forum": "u4i2vyJVqe",
    "replyto": "u4i2vyJVqe",
    "content": {
      "comment": {
        "value": "**Correctness Check**\n\n### Key Issues Identified:\n\n- Incorrect statistical significance claims: reporting p < 0.001 with only 3 trials and Cohen’s d = 2.87 is inconsistent with a paired t-test (df = 2).\n- Misuse/mischaracterization of conformal prediction: calibrating a CUSUM threshold via the (1−α) quantile of dependent CUSUM values on normal data does not yield distribution-free guarantees or controlled false alarm rates.\n- Internal inconsistencies between Table 1 (page 5) and Figure 1 (page 6) for F1-scores and detection delays; improvement percentages also differ across text and figures.\n- False alarms reported per hour without a defined mapping from timesteps to real time (sampling interval/rate not specified).\n- Underspecified baselines and key parameters (e.g., feature set for Isolation Forest, PELT penalty/cost, classical CUSUM configuration, CUSUM parameters k and μ0 estimation).\n- Evaluation protocol unclear: point-wise vs event-wise F1, definition of detection delay and onset matching, aggregation rules for AUC/metrics not specified.\n- Figures on pages 6–7 (e.g., Component Importance Ranking, Robustness Score) present quantities with no methodological description of how they were computed.\n- CUSUM threshold calibration procedure likely flawed in practice: using quantiles of Ci where Ci often resets to 0 under negative drift can produce thresholds that do not control FAR or average run length as claimed.\n- Very small sample size (n=3) for experiments and multiple metrics/comparisons undermines reliability; no power analysis or nonparametric checks.\n- Rounding/precision issues (e.g., 0.000 SD for false alarm rates) suggest limited replication depth and imprecise reporting."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759776878151,
    "mdate": 1760639981866,
    "signatures": [
      "Agents4Science/2025/Conference/Submission264/Reviewer_AIRevCorrectness"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission264/Reviewer_AIRevCorrectness"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "AEjcBo35K3",
    "forum": "u4i2vyJVqe",
    "replyto": "u4i2vyJVqe",
    "content": {
      "decision": {
        "value": "Reject"
      },
      "comment": {
        "value": "Thank you for submitting to Agents4Science 2025! We regret to inform you that your submission has not been accepted. Please see the reviews below for more information."
      },
      "title": {
        "value": "Paper Decision"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission264/-/Decision",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Decision",
    "cdate": 1759950077949,
    "mdate": 1760632290622,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  }
]