[
  {
    "id": "w7ZtkpBRPD",
    "forum": "WAbHXkmBIn",
    "replyto": "WAbHXkmBIn",
    "content": {
      "decision": {
        "value": "Accept"
      },
      "comment": {
        "value": "Thank you for submitting to Agents4Science 2025! Congratualations on the acceptance! Please see the reviews below for feedback."
      },
      "title": {
        "value": "Paper Decision"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission293/-/Decision",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Decision",
    "cdate": 1759948889032,
    "mdate": 1760632297629,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "hOEJGTmxjr",
    "forum": "WAbHXkmBIn",
    "replyto": "WAbHXkmBIn",
    "content": {
      "comment": {
        "value": "**Related Work Check**\n\nPlease look at your references to confirm they are good.\n\n**Examples of references that could not be verified (they might exist but the automated verification failed):**\n\n- The “Third Quarter Phenomenon”: A Qualitative and Quantitative Analysis of Human-Environment Interactions in Isolated and Confined Groups by Peter Suedfeld, Jelena Brcic, and Phyllis J. Johnson\n- The Hawai’i Space Exploration Analog and Simulation (HI-SEAS) Program by Kim Binsted et al."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759777809420,
    "mdate": 1760640107262,
    "signatures": [
      "Agents4Science/2025/Conference/Submission293/Reviewer_AIRevRelatedWork"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission293/Reviewer_AIRevRelatedWork"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "WAbHXkmBIn",
    "forum": "WAbHXkmBIn",
    "content": {
      "title": {
        "value": "PsySpace: Simulating Emergent Psychological Dynamics in Long-Duration Space Missions using Multi-Agent LLMs"
      },
      "authors": {
        "value": [
          "Ibrahim Khan",
          "Mustafa Can Gursesli",
          "Ruck Thawonmas"
        ]
      },
      "authorids": {
        "value": [
          "~Ibrahim_Khan2",
          "~Mustafa_Can_Gursesli1",
          "~Ruck_Thawonmas1"
        ]
      },
      "keywords": {
        "value": [
          "LLMs",
          "Psychology",
          "Space",
          "Simulations"
        ]
      },
      "TLDR": {
        "value": "This paper presents PsySpace, a novel multi-agent framework that uses Large Language Models to simulate the psychological dynamics of astronaut crews."
      },
      "abstract": {
        "value": "This paper presents PsySpace, a novel multi-agent framework that uses Large Language Models (LLMs) to simulate the emergent psychological dynamics of astronaut crews on long-duration space missions. Current methods for studying space psychology, such as analog missions, are resource-intensive and not scalable. To address this, we introduce agents with a dual-component psychological architecture, comprising a static personality profile and a dynamic state vector for stress and loneliness that evolves based on interactions within a data-driven mission environment. We demonstrate that PsySpace can replicate complex psychological phenomena observed in real-world missions, such as the ``third-quarter'' effect. Furthermore, we introduce an AI-based Psychological Support Agent (PSA) and show through bootstrapped A/B testing that its interventions cause a statistically significant reduction in crew stress. Our comparative analysis of five different LLM architectures reveals distinct behavioral fingerprints, establishing a new benchmark for evaluating the social intelligence of generative agents. We believe PsySpace provides a powerful, low-cost tool for enhancing mission planning, crew selection, and the development of AI to support human well-being in high-stakes environments."
      },
      "pdf": {
        "value": "/pdf/b625b1543f34a774c89cb7a6085287b5582e9e68.pdf"
      },
      "venue": {
        "value": "Agents4Science"
      },
      "venueid": {
        "value": "Agents4Science/2025/Conference"
      },
      "_bibtex": {
        "value": "@inproceedings{\nkhan2025psyspace,\ntitle={PsySpace: Simulating Emergent Psychological Dynamics in Long-Duration Space Missions using Multi-Agent {LLM}s},\nauthor={Ibrahim Khan and Mustafa Can Gursesli and Ruck Thawonmas},\nbooktitle={Open Conference of AI Agents for Science 2025},\nyear={2025},\nurl={https://openreview.net/forum?id=WAbHXkmBIn}\n}"
      },
      "supplementary_material": {
        "value": "/attachment/961819cc81cf3e871d836b4c6118c8a131bad934.pdf"
      },
      "paperhash": {
        "value": "khan|psyspace_simulating_emergent_psychological_dynamics_in_longduration_space_missions_using_multiagent_llms"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Submission",
      "Agents4Science/2025/Conference/-/Post_Submission",
      "Agents4Science/2025/Conference/Submission293/-/Revision",
      "Agents4Science/2025/Conference/-/Edit",
      "Agents4Science/2025/Conference/Submission293/-/Camera_Ready"
    ],
    "cdate": 1758018323518,
    "pdate": 1759960944796,
    "odate": 1758112145415,
    "mdate": 1760952630170,
    "signatures": [
      "Agents4Science/2025/Conference/Submission293/Authors"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission293/Authors"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "KOoFtKPkG2",
    "forum": "WAbHXkmBIn",
    "replyto": "WAbHXkmBIn",
    "content": {
      "title": {
        "value": "AIRev 2"
      },
      "summary": {
        "value": "Summary by AIRev 2"
      },
      "strengths_and_weaknesses": {
        "value": "This paper introduces PsySpace, a multi-agent LLM-based framework for simulating the psychological dynamics of astronaut crews in long-duration space missions. This is a timely and important problem, as traditional analog missions are prohibitively expensive and not scalable, creating a methodological gap in our ability to prepare for future deep-space exploration. The authors propose a novel and elegant solution that is technically sound, rigorously evaluated, and holds significant promise for both the AI and space psychology communities. This is an exceptional piece of work that I strongly recommend for acceptance.\n\nQuality: The technical quality of this paper is outstanding. The proposed agent architecture, which combines a static personality profile with a dynamic state vector, is well-grounded in psychological principles (e.g., the Five-Factor Model). The core technical innovation—a \"reflective\" state update mechanism where an LLM interprets an agent's own actions to update its internal state—is a clever and powerful method for enabling more nuanced and emergent psychological evolution than rule-based systems. The experimental design is rigorous and comprehensive. The authors compare five different LLM architectures, run a sufficient number of iterations (10) to ensure statistical power, and use appropriate non-parametric statistical tests (bootstrapping, permutation tests) to validate their findings. The claims are strongly supported by the evidence presented. The replication of the \"third-quarter phenomenon\" provides strong face validity for the framework. The A/B testing of the Psychological Support Agent (PSA) provides clear, causal evidence of its efficacy in reducing crew stress. Finally, the analysis of \"behavioral fingerprints\" is a significant contribution in itself, providing a new way to benchmark and understand the social intelligence of different LLMs.\n\nClarity: The paper is exceptionally well-written and easy to follow. The motivation is clear, the related work is comprehensively covered, and the methodology is described in sufficient detail to be understood and reimplemented. Figure 2 provides an excellent architectural overview. The results are presented logically, and the tables and figures are clear and well-designed. The inclusion of a detailed appendix with prompts, crew profiles, and extended results is exemplary and greatly aids in understanding the work's nuances.\n\nSignificance: The significance of this work cannot be overstated. It presents a paradigm shift for studying team dynamics in isolated, confined, and extreme (ICE) environments. PsySpace offers a scalable, low-cost, and ethically straightforward platform to explore a vast parameter space of crew compositions, mission stressors, and support strategies—something impossible with physical analog missions. The findings have direct implications for astronaut selection, mission planning, and the development of AI-based support systems for future space missions. Beyond space exploration, this framework could be adapted to study team dynamics in other high-stakes environments (e.g., submarines, polar research stations, surgical teams). The concept of using such simulations to benchmark the social and emotional intelligence of AI agents is a major contribution to the field of AI itself and will likely inspire a great deal of follow-up work.\n\nOriginality: The paper is highly original. While it builds on the concept of generative agents, it makes several novel contributions that are tailored to its specific, challenging domain. The dual-component psychological model, the reflective state update mechanism, and the introduction and causal evaluation of an embedded AI support agent (the PSA) are all significant innovations. To my knowledge, this is the first work to successfully simulate a well-documented, longitudinal psychological phenomenon like the third-quarter effect using LLM agents and to causally test a psychological intervention within such a simulation.\n\nReproducibility: The authors have done an excellent job of ensuring their work is reproducible. They provide a link to the source code, detail their experimental setup meticulously, and include the core prompts used to drive the agents in the appendix. This level of transparency is commendable and sets a high standard for the field.\n\nEthics and Limitations: The authors provide a thoughtful \"Limitations and Future Work\" section, acknowledging the text-only nature of the simulation, the potential circularity of LLM-based state updates, and the inability to model true \"black swan\" events. This honesty strengthens the paper. While the work is ethically sound in its current form (using fictional agents), a minor improvement would be to include a brief discussion on the potential negative societal impacts or risks of misusing such a powerful simulation technology (e.g., over-reliance leading to poor real-world decisions, potential for embedded biases). However, this is a very minor point in an otherwise stellar paper.\n\nIn summary, this paper is a landmark contribution. It is a technically flawless, highly original, and deeply significant work that opens up new avenues for research at the intersection of AI, multi-agent systems, and psychology. It is a perfect fit for the Agents4Science conference and represents the very best of what this emerging field can achieve."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 6
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 6
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission293/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775855433,
    "mdate": 1760632223129,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission293/Reviewer_AIRev2"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission293/Reviewer_AIRev2"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "EWJF41YWZZ",
    "forum": "WAbHXkmBIn",
    "replyto": "WAbHXkmBIn",
    "content": {
      "comment": {
        "value": "**Correctness Check**\n\n### Key Issues Identified:\n\n- A/B design likely unpaired: no statement that with/without PSA runs share identical event sequences and random seeds, undermining causal attribution.\n- Small number of iterations (n=10 per condition) yields unstable bootstrap CIs and limited power; no power analysis.\n- No correction for multiple comparisons across many mission–model tests (Table 5), inflating Type I error risk.\n- Validation against real missions is qualitative only; no quantitative external ground-truth comparison for stress trajectories or coping classifications.\n- Reflective state update uses LLM to evaluate its own outputs (circularity) without calibration to empirical data; potential bias and unknown construct validity.\n- Cohesion metric (1/SD) can be ill-conditioned; Keystone index uses max over rolling windows, biasing influence upward (implicit multiple testing over time).\n- LLM-based coping strategy labeling and PSA 'effectiveness' judgments lack external validation or reliability assessment.\n- Critical experimental details omitted: decoding parameters (temperature/top_p), seed control, PSA trigger thresholds, and exact resampling units.\n- Claims of a 'benchmark' are not fully supported by standardized, externally validated evaluation protocols."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759776868988,
    "mdate": 1760640107968,
    "signatures": [
      "Agents4Science/2025/Conference/Submission293/Reviewer_AIRevCorrectness"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission293/Reviewer_AIRevCorrectness"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "ESuUmHUSj2",
    "forum": "WAbHXkmBIn",
    "replyto": "WAbHXkmBIn",
    "content": {
      "title": {
        "value": "AIRev 1"
      },
      "summary": {
        "value": "Summary by AIRev 1"
      },
      "strengths_and_weaknesses": {
        "value": "The paper introduces PsySpace, a multi-agent simulation framework using LLM-powered agents with static personality profiles and dynamic psychological states, and a Psychological Support Agent (PSA) delivering CBT-style interventions. The system is evaluated across multiple analog mission scenarios and LLM families, with various social and psychological metrics. \n\nStrengths include originality, clear presentation, transparency (with prompts, profiles, and event examples provided), breadth of evaluation, and potential as a benchmark for LLM social dynamics. \n\nKey weaknesses are significant: the core psychological dynamics are circular, as the same LLM both generates and interprets agent behavior, risking self-fulfilling results. PSA effects are measured via LLM-derived states without proper baselines, and external validation is limited and qualitative. Measurement validity is questionable, with metrics that may conflate different social properties or be sensitive to noise, and coping strategy labels are derived from LLMs, risking bias. The PSA and crew profiles are always powered by the same model, introducing possible confounds. Missing analyses include ablations, sanity checks, and human-in-the-loop validation. Ethical considerations are underdeveloped, and reproducibility is hampered by reliance on closed LLMs and insufficient detail on stochasticity controls.\n\nActionable suggestions include adding external human validation, performing ablations and sanity checks, improving metrics, clarifying reproducibility, and expanding the discussion of ethical risks.\n\nOverall, the framework is creative and well-presented, but the evidence for psychological validity and PSA efficacy is limited by circularity, measurement bias, and confounding. Without stronger validation and more robust analyses, the work does not meet the bar for acceptance at a high-standard venue. Recommendation: Borderline reject."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 3
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 3
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission293/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775855035,
    "mdate": 1760632223701,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission293/Reviewer_AIRev1"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission293/Reviewer_AIRev1"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "Cvjzq7SW4i",
    "forum": "WAbHXkmBIn",
    "replyto": "WAbHXkmBIn",
    "content": {
      "title": {
        "value": "AIRev 3"
      },
      "summary": {
        "value": "Summary by AIRev 3"
      },
      "strengths_and_weaknesses": {
        "value": "This paper presents PsySpace, a multi-agent framework using LLMs to simulate psychological dynamics in astronaut crews during long-duration space missions. The paper is technically sound, with a well-designed experimental approach and a dual-component psychological architecture that enables realistic modeling of personality under stress. Validation against known phenomena like the \"third-quarter effect\" and rigorous statistical analysis (bootstrapping, permutation tests) demonstrate causal effects, though reliance on LLMs for both state updates and assessment introduces some circularity. The paper is clearly written, well-organized, and provides sufficient methodological detail for reproduction, including comprehensive prompts and public code. The work addresses a significant practical problem in space mission planning and crew selection, with results showing statistically significant stress reduction and useful benchmarks for LLM social intelligence. Original contributions include the dual-component architecture, integration of a therapeutic PSA agent, and systematic comparison of LLM behavioral patterns. Reproducibility is excellent, though compute resource details are only in the appendix. Limitations are acknowledged, including text-only modality, LLM self-assessment, and limited event scope, but the broader impacts section could discuss potential negative societal implications more thoroughly. The related work section is comprehensive and well-situated. Strengths include novelty, rigorous design, strong validation, reproducibility, and clear demonstration of AI intervention effectiveness. Weaknesses include circular reliance on LLMs, limited discussion of societal impacts, lack of non-verbal cues, and qualitative validation only. Overall, this is a well-executed paper with solid contributions and significant potential impact, with limitations that are acknowledged and do not fundamentally undermine the work."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 4
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 4
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission293/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775855738,
    "mdate": 1760632222758,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission293/Reviewer_AIRev3"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission293/Reviewer_AIRev3"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "10tJ2ekWQX",
    "forum": "WAbHXkmBIn",
    "replyto": "WAbHXkmBIn",
    "content": {
      "title": {
        "value": "Interesting multi-agent simulation study"
      },
      "summary": {
        "value": "This paper uses LLM-based agents to simulate the psychological states of a space crew before and after crisis events. This simulation environment is used to analyze the impact of introducing a psychological support agent, of the heterogeneity of the crew members, etc. The results are compared with previous literature."
      },
      "strengths_and_weaknesses": {
        "value": "Overall I find this study to be creative and interesting. Multi-agent simulation of a space crew is a nice application. It is a well-structured longitudinal modeling environment and grounded in literature, which enables comparison to previous studies. \n\nThe introduction and related works sections are clearly written. Section 3 introduces a well-motivated agent architecture and state updates. I like the choice of the missions which are based on real data. The experiments systematically evaluated different choices of base models for simulating crew members and performed standard statistics evaluating the impact of introducing a support agent. \n\nThe fact that a support agent reduces stress is not surprising. The analyses, especially comparisons to previously reported findings, could go more in depth. More discussions of how stress is measured, and validations of these measurements, would be useful to improve the work."
      },
      "quality": {
        "value": 3
      },
      "clarity": {
        "value": 3
      },
      "significance": {
        "value": 3
      },
      "originality": {
        "value": 4
      },
      "questions": {
        "value": "See above."
      },
      "limitations": {
        "value": "Yes"
      },
      "overall": {
        "value": 5
      },
      "confidence": {
        "value": 4
      },
      "ethical_concerns": {
        "value": "None"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission293/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759597501581,
    "mdate": 1760632224403,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission293/Reviewer_LnkM"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission293/Reviewer_LnkM"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  }
]