[
  {
    "id": "z1pIet03l4",
    "forum": "WGm2RSJSRI",
    "replyto": "WGm2RSJSRI",
    "content": {
      "title": {
        "value": "AIRev 2"
      },
      "summary": {
        "value": "Summary by AIRev 2"
      },
      "strengths_and_weaknesses": {
        "value": "This paper introduces 'attention intensity modulation,' a method for dynamically scaling attention scores in Transformers using a learned, position-aware complexity predictor, aiming to address inefficiencies in uniform attention application. The authors systematically evaluate several variants on four text modeling datasets, and the paper is praised for its clarity, organization, and transparency about mixed results.\n\nHowever, the reviewer identifies major weaknesses that preclude acceptance. The method yields only marginal and inconsistent performance improvements (e.g., 0.09% on text8, 0.15% on enwik8, but negative on others), and the most complex model underperforms compared to a simpler variant, contradicting the paper's narrative. The explanation for content-dependent results is speculative and unsupported by analysis. Experimental rigor is lacking, with insufficient random seeds and no statistical significance testing, and the code is not yet public, hampering reproducibility. The absence of dedicated Limitations and Broader Impacts sections is also noted as a significant omission.\n\nThe reviewer commends the paper's clarity, logical structure, and strong related work section but ultimately finds the contribution insignificant due to weak results, superficial analysis, and narrative inconsistencies. Constructive feedback includes demonstrating more substantial impact, providing deeper analysis, correcting the narrative, improving experimental rigor, and adding missing sections. As it stands, the paper is a well-executed exploration of an idea that did not yield impactful results and lacks the analysis needed for a compelling negative result paper, thus not meeting the bar for acceptance."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 3
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 3
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission143/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775833067,
    "mdate": 1760632177731,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission143/Reviewer_AIRev2"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission143/Reviewer_AIRev2"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "wMKRs4UQXR",
    "forum": "WGm2RSJSRI",
    "replyto": "WGm2RSJSRI",
    "content": {
      "comment": {
        "value": "**Correctness Check**\n\n### Key Issues Identified:\n\n- Selective flash attention integration is under-specified and contradictory: modulation is reportedly disabled under flash attention (Sec. 4.3) yet the paper claims preserved adaptive benefits and near-baseline speed (Secs. 4.3, 6.2; Table 1). It is unclear when modulation is active, undermining speed/performance claims.\n- Table 1 (p. 6) reports a single 'Validation Loss' apparently averaged across heterogeneous datasets, which is not a meaningful aggregate metric and confounds interpretation.\n- Insufficient statistical rigor: enwik8 and text8 use only 1 seed each (Sec. 5.2) while reporting very small gains (0.09–0.15%). Claims of statistical significance (checklist, p. 10) are thus not supported for these datasets.\n- Notation inconsistency: multi-head intensity is proposed (Sec. 4.1), but equations (e.g., Eq. 8) omit the head index, reducing formal clarity.\n- Technical mismatch with flash attention: per-query logit scaling is implementable within flash attention (e.g., per-row softmax scale or scaling Q), yet the paper disables modulation in that setting (Sec. 4.3), casting doubt on the claimed compatibility and efficiency strategy.\n- No ablation against simpler equivalent mechanisms (e.g., learning per-query temperature via scaling Q; allowing intensity >1 to test sharpening) limits understanding of necessity and effect size of the proposed predictor.\n- Interpretation overreach: content-dependence is plausible, but the marginal, non-replicated improvements and mixed results do not robustly validate the approach."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759776860902,
    "mdate": 1760640106367,
    "signatures": [
      "Agents4Science/2025/Conference/Submission143/Reviewer_AIRevCorrectness"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission143/Reviewer_AIRevCorrectness"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "kNOtSfSivh",
    "forum": "WGm2RSJSRI",
    "replyto": "WGm2RSJSRI",
    "content": {
      "title": {
        "value": "AIRev 1"
      },
      "summary": {
        "value": "Summary by AIRev 1"
      },
      "strengths_and_weaknesses": {
        "value": "The paper proposes a lightweight attention intensity modulation mechanism for transformers, scaling attention logits per query position by a learned scalar factor in [0.2, 1.0]. The method is simple and integrates with standard attention, but only allows attenuation, not amplification, and this design choice is not justified or ablated. The mechanism is conceptually similar to known ideas (gating/temperature scaling), and its novelty is questionable. Experimental results show extremely small and mixed gains, with improvements within likely noise for single-seed runs and lacking statistical support. Key baselines and ablations are missing, such as global per-head temperature, content-only vs position-only predictors, and different intensity ranges. The integration with fast attention kernels (flash attention) is problematic, as modulation is disabled to preserve speed, undermining practical deployment and the claimed adaptive benefits. The writing is mostly clear, but there are ambiguities regarding when modulation is enabled/disabled. The paper lacks justification for key hyperparameters and does not engage with closely related work. Reproducibility is limited by the absence of released code and insufficient seeds for reliable results. No ethical concerns are noted, but a dedicated limitations section is missing. The paper's significance is limited by the modest conceptual contribution, minor empirical gains, and unclear practical value. Actionable suggestions include resolving the flash attention contradiction, strengthening baselines and ablations, expanding evaluation, clarifying motivation and theory, and adding a broader impacts section. Overall, the paper addresses a relevant problem with a simple mechanism, but due to tiny and statistically unconvincing improvements, unclear integration with fast kernels, missing baselines and related work, and unavailable code, I cannot recommend acceptance at this time."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 2
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 2
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission143/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775832823,
    "mdate": 1760632177928,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission143/Reviewer_AIRev1"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission143/Reviewer_AIRev1"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "gUbmXqVc2B",
    "forum": "WGm2RSJSRI",
    "replyto": "WGm2RSJSRI",
    "content": {
      "decision": {
        "value": "Reject"
      },
      "comment": {
        "value": "Thank you for submitting to Agents4Science 2025! We regret to inform you that your submission has not been accepted. Please see the reviews below for more information."
      },
      "title": {
        "value": "Paper Decision"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission143/-/Decision",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Decision",
    "cdate": 1759950113783,
    "mdate": 1760632276768,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Program_Chairs"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "WGm2RSJSRI",
    "forum": "WGm2RSJSRI",
    "content": {
      "title": {
        "value": "Learning to Look Harder: Position-Aware Attention Intensity Modulation in Transformers"
      },
      "keywords": {
        "value": [
          "Transformer Attention; Intensity Modulation; Position-Aware Prediction; Efficiency-Performance Tradeoff"
        ]
      },
      "abstract": {
        "value": "Transformer attention mechanisms waste computational resources by applying uniform intensity across all sequence positions, treating simple and complex contexts equally. We propose attention intensity modulation, a lightweight method that dynamically scales attention strength through multi-head position-aware complexity prediction. Our approach augments each attention block with a predictor that outputs head-specific intensity factors (0.2--1.0), scaling attention scores before softmax based on both content embeddings and learned positional information. Comprehensive evaluation across four text modeling datasets (shakespeare\\_char, enwik8, text8, Project Gutenberg) using a 6-layer GPT architecture reveals mixed results: modest improvements on text8 (0.09\\%) and enwik8 (0.15\\%), with slight degradation on shakespeare\\_char (-0.47\\%) and gutenberg (-0.26\\%). The multi-head approach enables head-specific adaptation but adds complexity that may not be justified by performance gains across all text types. Through systematic optimization, we maintain near-baseline inference speeds (720--730 tokens/sec) via selective flash attention integration. Our experimental progression demonstrates that while position-awareness is essential, architectural complexity requires careful balance with practical benefits."
      },
      "pdf": {
        "value": "/pdf/6f774dba8020e0a054c1688b1d7fa6c96604f7f8.pdf"
      },
      "venue": {
        "value": "Submitted to Agents4Science"
      },
      "venueid": {
        "value": "Agents4Science/2025/Conference/Rejected_Submission"
      },
      "_bibtex": {
        "value": "@misc{\nanonymous2025learning,\ntitle={Learning to Look Harder: Position-Aware Attention Intensity Modulation in Transformers},\nauthor={Anonymous},\nyear={2025},\nurl={https://openreview.net/forum?id=WGm2RSJSRI}\n}"
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Submission",
      "Agents4Science/2025/Conference/-/Post_Submission",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1757818314108,
    "odate": 1758112145415,
    "mdate": 1759960938087,
    "signatures": [
      "Agents4Science/2025/Conference/Submission143/Authors"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission143/Authors"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "Kf9P1Sd95j",
    "forum": "WGm2RSJSRI",
    "replyto": "WGm2RSJSRI",
    "content": {
      "comment": {
        "value": "**Related Work Check**\n\nNo hallucinated references detected."
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "cdate": 1759777818022,
    "mdate": 1760640105696,
    "signatures": [
      "Agents4Science/2025/Conference/Submission143/Reviewer_AIRevRelatedWork"
    ],
    "writers": [
      "Agents4Science/2025/Conference/Submission143/Reviewer_AIRevRelatedWork"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  },
  {
    "id": "AIqNt8b0su",
    "forum": "WGm2RSJSRI",
    "replyto": "WGm2RSJSRI",
    "content": {
      "title": {
        "value": "AIRev 3"
      },
      "summary": {
        "value": "Summary by AIRev 3"
      },
      "strengths_and_weaknesses": {
        "value": "This paper proposes attention intensity modulation for transformers, aiming to dynamically scale attention computation based on predicted context complexity. The approach is technically sound, with a systematic experimental methodology and a well-designed multi-head position-aware intensity prediction mechanism. The experimental setup is comprehensive, covering four diverse text datasets and including proper statistical analysis. However, the results are mixed: modest improvements on some datasets (0.09% on text8, 0.15% on enwik8) but degradation on others (-0.47% on shakespeare_char, -0.26% on gutenberg). The authors are transparent about these mixed results and limitations.\n\nThe paper is well-written, clearly organized, and provides sufficient methodological detail. The figures and experimental progression are logical and easy to follow. While the idea of adaptive attention allocation is interesting, the practical impact is limited due to the small and inconsistent improvements. The computational efficiency recovery is noted but does not offset the limited performance gains. The originality lies in the position-aware prediction combined with multi-head intensity modulation, though the contribution is incremental given prior work on adaptive computation in transformers.\n\nReproducibility is supported by comprehensive implementation details, though full code availability is incomplete. The authors acknowledge the mixed results and trade-offs but lack a dedicated limitations section. The related work section is comprehensive and well-contextualized.\n\nMajor concerns include the modest and inconsistent performance improvements, degradation on some datasets, questionable justification for added complexity, and lack of analysis on dataset-specific performance. Minor issues include the missing limitations section, absent broader impacts discussion, and some unclear implementation details.\n\nOverall, the paper demonstrates solid experimental work and honest reporting, but its practical significance is limited by the very modest and inconsistent improvements."
      },
      "questions": {
        "value": "N/A"
      },
      "limitations": {
        "value": "N/A"
      },
      "confidence": {
        "value": 5
      },
      "ethical_concerns": {
        "value": ""
      },
      "overall": {
        "value": 3
      },
      "quality": {
        "value": 0
      },
      "clarity": {
        "value": 0
      },
      "significance": {
        "value": 0
      },
      "originality": {
        "value": 0
      },
      "ai_review_score": {
        "value": 3
      }
    },
    "invitations": [
      "Agents4Science/2025/Conference/Submission143/-/Official_Review",
      "Agents4Science/2025/Conference/-/Edit"
    ],
    "parentInvitations": "Agents4Science/2025/Conference/-/Official_Review",
    "cdate": 1759775833333,
    "mdate": 1760632177610,
    "nonreaders": [],
    "signatures": [
      "Agents4Science/2025/Conference/Submission143/Reviewer_AIRev3"
    ],
    "writers": [
      "Agents4Science/2025/Conference",
      "Agents4Science/2025/Conference/Submission143/Reviewer_AIRev3"
    ],
    "readers": [
      "everyone"
    ],
    "license": "CC BY 4.0"
  }
]